SpenceKonde/DxCore/megaavr/boards.txt
# See: https://github.com/arduino/Arduino/wiki/Arduino-IDE-1.5-3rd-party-Hardware-specification


menu.chip=Chip
menu.bodvoltage=BOD Voltage
menu.bodmodeactive=BOD Mode (active)
menu.bodmodesleep=BOD Mode (sleep)
menu.eesave=Save EEPROM
menu.clock=Clock Speed
menu.millis=millis()/micros()
menu.resetpin=Reset pin function
menu.adcworkaround=ADC Workaround mode
menu.bootloaderusart=Bootloader Serial Port
menu.timeout=Bootloader Timeout
menu.mvio=MVIO (MultiVoltage I/O on PORTC)


##############################################################

#########################################
#
#    28 PIN AVR DA-series
#
#########################################


avrda28.name=28-pin AVR DA

avrda28.bootloader.SYSCFG1=0x03

avrda28.menu.chip.128A=AVR128DA28
avrda28.menu.chip.128A.build.mcu=avr128da28
avrda28.menu.chip.128A.upload.maximum_size=131072
avrda28.menu.chip.128A.upload.maximum_data_size=16384
avrda28.menu.chip.64A=AVR64DA28
avrda28.menu.chip.64A.build.mcu=avr64da28
avrda28.menu.chip.64A.upload.maximum_size=65536
avrda28.menu.chip.64A.upload.maximum_data_size=8192
avrda28.menu.chip.32A=AVR32DA28
avrda28.menu.chip.32A.build.mcu=avr32da28
avrda28.menu.chip.32A.upload.maximum_size=32768
avrda28.menu.chip.32A.upload.maximum_data_size=4096


avrda28.menu.clock.24internal=24 MHz internal
avrda28.menu.clock.24internal.build.f_cpu=24000000L
avrda28.menu.clock.24internal.build.speed=24
avrda28.menu.clock.24internal.build.clocksource=0
avrda28.menu.clock.20internal=20 MHz internal
avrda28.menu.clock.20internal.build.f_cpu=20000000L
avrda28.menu.clock.20internal.build.speed=20
avrda28.menu.clock.20internal.build.clocksource=0
avrda28.menu.clock.16internal=16 MHz internal
avrda28.menu.clock.16internal.build.f_cpu=16000000L
avrda28.menu.clock.16internal.build.speed=16
avrda28.menu.clock.16internal.build.clocksource=0
avrda28.menu.clock.12internal=12 MHz internal
avrda28.menu.clock.12internal.build.f_cpu=12000000L
avrda28.menu.clock.12internal.build.speed=12
avrda28.menu.clock.12internal.build.clocksource=0
avrda28.menu.clock.10internal=10 MHz internal
avrda28.menu.clock.10internal.build.f_cpu=10000000L
avrda28.menu.clock.10internal.build.speed=10
avrda28.menu.clock.10internal.build.clocksource=0
avrda28.menu.clock.8internal=8 MHz internal
avrda28.menu.clock.8internal.build.f_cpu=8000000L
avrda28.menu.clock.8internal.build.speed=8
avrda28.menu.clock.8internal.build.clocksource=0
avrda28.menu.clock.4internal=4 MHz internal
avrda28.menu.clock.4internal.build.f_cpu=4000000L
avrda28.menu.clock.4internal.build.speed=4
avrda28.menu.clock.4internal.build.clocksource=0
avrda28.menu.clock.1internal=1 MHz internal
avrda28.menu.clock.1internal.build.f_cpu=1000000L
avrda28.menu.clock.1internal.build.speed=1
avrda28.menu.clock.1internal.build.clocksource=0
avrda28.menu.clock.28internal=28 MHz internal (overclocked)
avrda28.menu.clock.28internal.build.f_cpu=28000000L
avrda28.menu.clock.28internal.build.speed=28
avrda28.menu.clock.28internal.build.clocksource=0
avrda28.menu.clock.32internal=32 MHz internal (overclocked)
avrda28.menu.clock.32internal.build.f_cpu=32000000L
avrda28.menu.clock.32internal.build.speed=32
avrda28.menu.clock.32internal.build.clocksource=0
avrda28.menu.clock.24extclock=24 MHz ext. clock
avrda28.menu.clock.24extclock.build.f_cpu=24000000L
avrda28.menu.clock.24extclock.build.speed=24
avrda28.menu.clock.24extclock.build.clocksource=2
avrda28.menu.clock.20extclock=20 MHz ext. clock
avrda28.menu.clock.20extclock.build.f_cpu=20000000L
avrda28.menu.clock.20extclock.build.speed=20
avrda28.menu.clock.20extclock.build.clocksource=2
avrda28.menu.clock.16extclock=16 MHz ext. clock
avrda28.menu.clock.16extclock.build.f_cpu=16000000L
avrda28.menu.clock.16extclock.build.speed=16
avrda28.menu.clock.16extclock.build.clocksource=2
avrda28.menu.clock.12extclock=12 MHz ext. clock
avrda28.menu.clock.12extclock.build.f_cpu=12000000L
avrda28.menu.clock.12extclock.build.speed=12
avrda28.menu.clock.12extclock.build.clocksource=2
avrda28.menu.clock.8extclock=8 MHz ext. clock
avrda28.menu.clock.8extclock.build.f_cpu=8000000L
avrda28.menu.clock.8extclock.build.speed=8
avrda28.menu.clock.8extclock.build.clocksource=2
avrda28.menu.clock.28extclock=28 MHz ext. clock (overclocked)
avrda28.menu.clock.28extclock.build.f_cpu=28000000L
avrda28.menu.clock.28extclock.build.speed=28
avrda28.menu.clock.28extclock.build.clocksource=2
avrda28.menu.clock.32extclock=32 MHz ext. clock (overclocked)
avrda28.menu.clock.32extclock.build.f_cpu=32000000L
avrda28.menu.clock.32extclock.build.speed=32
avrda28.menu.clock.32extclock.build.clocksource=2
avrda28.menu.clock.36extclock=36 MHz ext. clock (overclocked)
avrda28.menu.clock.36extclock.build.f_cpu=36000000L
avrda28.menu.clock.36extclock.build.speed=36
avrda28.menu.clock.36extclock.build.clocksource=2
avrda28.menu.clock.40extclock=40 MHz ext. clock (overclocked)
avrda28.menu.clock.40extclock.build.f_cpu=40000000L
avrda28.menu.clock.40extclock.build.speed=40
avrda28.menu.clock.40extclock.build.clocksource=2
avrda28.menu.clock.48extclock=48 MHz ext. clock (WAY overclocked)
avrda28.menu.clock.48extclock.build.f_cpu=48000000L
avrda28.menu.clock.48extclock.build.speed=48
avrda28.menu.clock.48extclock.build.clocksource=2

avrda28.build.adcworkaround=
avrda28.menu.adcworkaround.simple=Enabled
avrda28.menu.adcworkaround.simple.build.adcworkaround=-DSIMPLE_ADC_WORKAROUND
avrda28.menu.adcworkaround.none=Disabled


avrda28.menu.bodvoltage.1v9=1.9V
avrda28.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrda28.menu.bodvoltage.2v45=2.45V
avrda28.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrda28.menu.bodvoltage.2v70=2.70V
avrda28.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrda28.menu.bodvoltage.2v85=2.85V
avrda28.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrda28.menu.bodmodeactive.disabled=Disabled
avrda28.menu.bodmodeactive.enabled=Enabled
avrda28.menu.bodmodeactive.sampled=Sampled
avrda28.menu.bodmodeactive.enabledhold=Enabled hold wakeup
avrda28.menu.bodmodesleep.disabled=Disabled
avrda28.menu.bodmodesleep.enabled=Enabled
avrda28.menu.bodmodesleep.sampled=Sampled
avrda28.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
avrda28.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
avrda28.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
avrda28.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
avrda28.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
avrda28.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
avrda28.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10


