SpenceKonde/DxCore/megaavr/boards.txt
avrda28.menu.eesave.enable=EEPROM retained
avrda28.menu.eesave.enable.bootloader.eesavebit=1
avrda28.menu.eesave.disable=EEPROM not retained
avrda28.menu.eesave.disable.bootloader.eesavebit=0

avrda28.menu.resetpin.reset=Hardware Reset (recommended)
avrda28.menu.resetpin.reset.bootloader.resetpinbits=10
avrda28.menu.resetpin.input=Input (no output, ever)
avrda28.menu.resetpin.input.bootloader.resetpinbits=00

avrda28.menu.millis.tcb2=TCB2 (recommended)
avrda28.menu.millis.tca0=TCA0
avrda28.menu.millis.tcb0=TCB0 (will break Servo)
avrda28.menu.millis.tcb1=TCB1 (will break tone)
#avrda28.menu.millis.tcd0=TCD0
avrda28.menu.millis.disabled=Disabled

avrda28.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
avrda28.menu.millis.tcb0.build.millistimer=B0
avrda28.menu.millis.tcb1.build.millistimer=B1
avrda28.menu.millis.tcb2.build.millistimer=B2
avrda28.menu.millis.tca0.build.millistimer=A0
#avrda28.menu.millis.tcd0.build.millistimer=D0
avrda28.menu.millis.disabled.build.millistimer=NONE

avrda28.upload.tool=avrdude

avrda28.build.board=avrda28
avrda28.build.core=dxcore
avrda28.build.variant=28pin-standard
avrda28.build.text_section_start=.text=0x0
avrda28.build.extra_flags={build.millis} {build.adcworkaround} -DCLOCK_SOURCE={build.clocksource}
avrda28.build.export_merged_output=false
avrda28.build.mcupostfix=

avrda28.bootloader.tool=avrdude
avrda28.bootloader.WDTCFG=0x00
avrda28.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits}
avrda28.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
avrda28.bootloader.SYSCFG1=0x03
avrda28.bootloader.CODESIZE=0x00
avrda28.bootloader.BOOTSIZE=0x00

avrda28.bootloader.flashcommand=



#########################################
#
#    32 PIN AVR DA-series
#
#########################################


avrda32.name=32-pin AVR DA

avrda32.bootloader.SYSCFG1=0x03

avrda32.menu.chip.128A=AVR128DA32
avrda32.menu.chip.128A.build.mcu=avr128da32
avrda32.menu.chip.128A.upload.maximum_size=131072
avrda32.menu.chip.128A.upload.maximum_data_size=16384
avrda32.menu.chip.64A=AVR64DA32
avrda32.menu.chip.64A.build.mcu=avr64da32
avrda32.menu.chip.64A.upload.maximum_size=65536
avrda32.menu.chip.64A.upload.maximum_data_size=8192
avrda32.menu.chip.32A=AVR32DA32
avrda32.menu.chip.32A.build.mcu=avr32da32
avrda32.menu.chip.32A.upload.maximum_size=32768
avrda32.menu.chip.32A.upload.maximum_data_size=4096


avrda32.menu.clock.24internal=24 MHz internal
avrda32.menu.clock.24internal.build.f_cpu=24000000L
avrda32.menu.clock.24internal.build.speed=24
avrda32.menu.clock.24internal.build.clocksource=0
avrda32.menu.clock.20internal=20 MHz internal
avrda32.menu.clock.20internal.build.f_cpu=20000000L
avrda32.menu.clock.20internal.build.speed=20
avrda32.menu.clock.20internal.build.clocksource=0
avrda32.menu.clock.16internal=16 MHz internal
avrda32.menu.clock.16internal.build.f_cpu=16000000L
avrda32.menu.clock.16internal.build.speed=16
avrda32.menu.clock.16internal.build.clocksource=0
avrda32.menu.clock.12internal=12 MHz internal
avrda32.menu.clock.12internal.build.f_cpu=12000000L
avrda32.menu.clock.12internal.build.speed=12
avrda32.menu.clock.12internal.build.clocksource=0
avrda32.menu.clock.10internal=10 MHz internal
avrda32.menu.clock.10internal.build.f_cpu=10000000L
avrda32.menu.clock.10internal.build.speed=10
avrda32.menu.clock.10internal.build.clocksource=0
avrda32.menu.clock.8internal=8 MHz internal
avrda32.menu.clock.8internal.build.f_cpu=8000000L
avrda32.menu.clock.8internal.build.speed=8
avrda32.menu.clock.8internal.build.clocksource=0
avrda32.menu.clock.4internal=4 MHz internal
avrda32.menu.clock.4internal.build.f_cpu=4000000L
avrda32.menu.clock.4internal.build.speed=4
avrda32.menu.clock.4internal.build.clocksource=0
avrda32.menu.clock.1internal=1 MHz internal
avrda32.menu.clock.1internal.build.f_cpu=1000000L
avrda32.menu.clock.1internal.build.speed=1
avrda32.menu.clock.1internal.build.clocksource=0
avrda32.menu.clock.28internal=28 MHz internal (overclocked)
avrda32.menu.clock.28internal.build.f_cpu=28000000L
avrda32.menu.clock.28internal.build.speed=28
avrda32.menu.clock.28internal.build.clocksource=0
avrda32.menu.clock.32internal=32 MHz internal (overclocked)
avrda32.menu.clock.32internal.build.f_cpu=32000000L
avrda32.menu.clock.32internal.build.speed=32
avrda32.menu.clock.32internal.build.clocksource=0
avrda32.menu.clock.24extclock=24 MHz ext. clock
avrda32.menu.clock.24extclock.build.f_cpu=24000000L
avrda32.menu.clock.24extclock.build.speed=24
avrda32.menu.clock.24extclock.build.clocksource=2
avrda32.menu.clock.20extclock=20 MHz ext. clock
avrda32.menu.clock.20extclock.build.f_cpu=20000000L
avrda32.menu.clock.20extclock.build.speed=20
avrda32.menu.clock.20extclock.build.clocksource=2
avrda32.menu.clock.16extclock=16 MHz ext. clock
avrda32.menu.clock.16extclock.build.f_cpu=16000000L
avrda32.menu.clock.16extclock.build.speed=16
avrda32.menu.clock.16extclock.build.clocksource=2
avrda32.menu.clock.12extclock=12 MHz ext. clock
avrda32.menu.clock.12extclock.build.f_cpu=12000000L
avrda32.menu.clock.12extclock.build.speed=12
avrda32.menu.clock.12extclock.build.clocksource=2
avrda32.menu.clock.8extclock=8 MHz ext. clock
avrda32.menu.clock.8extclock.build.f_cpu=8000000L
avrda32.menu.clock.8extclock.build.speed=8
avrda32.menu.clock.8extclock.build.clocksource=2
avrda32.menu.clock.28extclock=28 MHz ext. clock (overclocked)
avrda32.menu.clock.28extclock.build.f_cpu=28000000L
avrda32.menu.clock.28extclock.build.speed=28
avrda32.menu.clock.28extclock.build.clocksource=2
avrda32.menu.clock.32extclock=32 MHz ext. clock (overclocked)
avrda32.menu.clock.32extclock.build.f_cpu=32000000L
avrda32.menu.clock.32extclock.build.speed=32
avrda32.menu.clock.32extclock.build.clocksource=2
avrda32.menu.clock.36extclock=36 MHz ext. clock (overclocked)
avrda32.menu.clock.36extclock.build.f_cpu=36000000L
avrda32.menu.clock.36extclock.build.speed=36
avrda32.menu.clock.36extclock.build.clocksource=2
avrda32.menu.clock.40extclock=40 MHz ext. clock (overclocked)
avrda32.menu.clock.40extclock.build.f_cpu=40000000L
avrda32.menu.clock.40extclock.build.speed=40
avrda32.menu.clock.40extclock.build.clocksource=2
avrda32.menu.clock.48extclock=48 MHz ext. clock (WAY overclocked)
avrda32.menu.clock.48extclock.build.f_cpu=48000000L
avrda32.menu.clock.48extclock.build.speed=48
avrda32.menu.clock.48extclock.build.clocksource=2

