SpenceKonde/DxCore/megaavr/boards.txt
avrda32.build.adcworkaround=
avrda32.menu.adcworkaround.simple=Simple
avrda32.menu.adcworkaround.simple.build.adcworkaround=-DSIMPLE_ADC_WORKAROUND
avrda32.menu.adcworkaround.none=Startup only



avrda32.menu.bodvoltage.1v9=1.9V
avrda32.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrda32.menu.bodvoltage.2v45=2.45V
avrda32.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrda32.menu.bodvoltage.2v70=2.70V
avrda32.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrda32.menu.bodvoltage.2v85=2.85V
avrda32.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrda32.menu.bodmodeactive.disabled=Disabled
avrda32.menu.bodmodeactive.enabled=Enabled
avrda32.menu.bodmodeactive.sampled=Sampled
avrda32.menu.bodmodeactive.enabledhold=Enabled hold wakeup
avrda32.menu.bodmodesleep.disabled=Disabled
avrda32.menu.bodmodesleep.enabled=Enabled
avrda32.menu.bodmodesleep.sampled=Sampled
avrda32.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
avrda32.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
avrda32.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
avrda32.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
avrda32.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
avrda32.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
avrda32.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10


avrda32.menu.eesave.enable=EEPROM retained
avrda32.menu.eesave.enable.bootloader.eesavebit=1
avrda32.menu.eesave.disable=EEPROM not retained
avrda32.menu.eesave.disable.bootloader.eesavebit=0

avrda32.menu.resetpin.reset=Hardware Reset (recommended)
avrda32.menu.resetpin.reset.bootloader.resetpinbits=10
avrda32.menu.resetpin.input=Input (no output, ever)
avrda32.menu.resetpin.input.bootloader.resetpinbits=00

avrda32.menu.millis.tcb2=TCB2 (recommended)
avrda32.menu.millis.tca0=TCA0
avrda32.menu.millis.tcb0=TCB0 (will break Servo)
avrda32.menu.millis.tcb1=TCB1
#avrda32.menu.millis.tcd0=TCD0
avrda32.menu.millis.disabled=Disabled

avrda32.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
avrda32.menu.millis.tcb0.build.millistimer=B0
avrda32.menu.millis.tcb1.build.millistimer=B1
avrda32.menu.millis.tcb2.build.millistimer=B2
avrda32.menu.millis.tca0.build.millistimer=A0
#avrda32.menu.millis.tcd0.build.millistimer=D0
avrda32.menu.millis.disabled.build.millistimer=NONE

avrda32.upload.tool=avrdude

avrda32.build.board=avrda32
avrda32.build.core=dxcore
avrda32.build.variant=32pin-standard
avrda32.build.text_section_start=.text=0x0
avrda32.build.extra_flags={build.millis} {build.adcworkaround} -DCLOCK_SOURCE={build.clocksource}
avrda32.build.export_merged_output=false
avrda32.build.mcupostfix=

avrda32.bootloader.tool=avrdude
avrda32.bootloader.WDTCFG=0x00
avrda32.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits}
avrda32.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
avrda32.bootloader.SYSCFG1=0x03
avrda32.bootloader.CODESIZE=0x00
avrda32.bootloader.BOOTSIZE=0x00

avrda32.bootloader.flashcommand=






#########################################
#
#    48 PIN AVR DA-series
#
#########################################



avrda48.name=48-pin AVR DA

avrda48.bootloader.SYSCFG1=0x03

avrda48.menu.chip.128A=AVR128DA48
avrda48.menu.chip.128A.build.mcu=avr128da48
avrda48.menu.chip.128A.upload.maximum_size=131072
avrda48.menu.chip.128A.upload.maximum_data_size=16384
avrda48.menu.chip.64A=AVR64DA48
avrda48.menu.chip.64A.build.mcu=avr64da48
avrda48.menu.chip.64A.upload.maximum_size=65536
avrda48.menu.chip.64A.upload.maximum_data_size=8192
avrda48.menu.chip.32A=AVR32DA48
avrda48.menu.chip.32A.build.mcu=avr32da48
avrda48.menu.chip.32A.upload.maximum_size=32768
avrda48.menu.chip.32A.upload.maximum_data_size=4096


avrda48.menu.clock.24internal=24 MHz internal
avrda48.menu.clock.24internal.build.f_cpu=24000000L
avrda48.menu.clock.24internal.build.speed=24
avrda48.menu.clock.24internal.build.clocksource=0
avrda48.menu.clock.20internal=20 MHz internal
avrda48.menu.clock.20internal.build.f_cpu=20000000L
avrda48.menu.clock.20internal.build.speed=20
avrda48.menu.clock.20internal.build.clocksource=0
avrda48.menu.clock.16internal=16 MHz internal
avrda48.menu.clock.16internal.build.f_cpu=16000000L
avrda48.menu.clock.16internal.build.speed=16
avrda48.menu.clock.16internal.build.clocksource=0
avrda48.menu.clock.12internal=12 MHz internal
avrda48.menu.clock.12internal.build.f_cpu=12000000L
avrda48.menu.clock.12internal.build.speed=12
avrda48.menu.clock.12internal.build.clocksource=0
avrda48.menu.clock.10internal=10 MHz internal
avrda48.menu.clock.10internal.build.f_cpu=10000000L
avrda48.menu.clock.10internal.build.speed=10
avrda48.menu.clock.10internal.build.clocksource=0
avrda48.menu.clock.8internal=8 MHz internal
avrda48.menu.clock.8internal.build.f_cpu=8000000L
avrda48.menu.clock.8internal.build.speed=8
avrda48.menu.clock.8internal.build.clocksource=0
avrda48.menu.clock.4internal=4 MHz internal
avrda48.menu.clock.4internal.build.f_cpu=4000000L
avrda48.menu.clock.4internal.build.speed=4
avrda48.menu.clock.4internal.build.clocksource=0
avrda48.menu.clock.1internal=1 MHz internal
avrda48.menu.clock.1internal.build.f_cpu=1000000L
avrda48.menu.clock.1internal.build.speed=1
avrda48.menu.clock.1internal.build.clocksource=0
avrda48.menu.clock.28internal=28 MHz internal (overclocked)
avrda48.menu.clock.28internal.build.f_cpu=28000000L
avrda48.menu.clock.28internal.build.speed=28
avrda48.menu.clock.28internal.build.clocksource=0
avrda48.menu.clock.32internal=32 MHz internal (overclocked)
avrda48.menu.clock.32internal.build.f_cpu=32000000L
avrda48.menu.clock.32internal.build.speed=32
avrda48.menu.clock.32internal.build.clocksource=0
avrda48.menu.clock.24extclock=24 MHz ext. clock
avrda48.menu.clock.24extclock.build.f_cpu=24000000L
avrda48.menu.clock.24extclock.build.speed=24
avrda48.menu.clock.24extclock.build.clocksource=2
avrda48.menu.clock.20extclock=20 MHz ext. clock
avrda48.menu.clock.20extclock.build.f_cpu=20000000L
avrda48.menu.clock.20extclock.build.speed=20
avrda48.menu.clock.20extclock.build.clocksource=2
avrda48.menu.clock.16extclock=16 MHz ext. clock
avrda48.menu.clock.16extclock.build.f_cpu=16000000L
avrda48.menu.clock.16extclock.build.speed=16
avrda48.menu.clock.16extclock.build.clocksource=2
avrda48.menu.clock.12extclock=12 MHz ext. clock
avrda48.menu.clock.12extclock.build.f_cpu=12000000L
avrda48.menu.clock.12extclock.build.speed=12
avrda48.menu.clock.12extclock.build.clocksource=2
avrda48.menu.clock.8extclock=8 MHz ext. clock
avrda48.menu.clock.8extclock.build.f_cpu=8000000L
avrda48.menu.clock.8extclock.build.speed=8
avrda48.menu.clock.8extclock.build.clocksource=2
avrda48.menu.clock.28extclock=28 MHz ext. clock (overclocked)
avrda48.menu.clock.28extclock.build.f_cpu=28000000L
avrda48.menu.clock.28extclock.build.speed=28
avrda48.menu.clock.28extclock.build.clocksource=2
avrda48.menu.clock.32extclock=32 MHz ext. clock (overclocked)
avrda48.menu.clock.32extclock.build.f_cpu=32000000L
avrda48.menu.clock.32extclock.build.speed=32
avrda48.menu.clock.32extclock.build.clocksource=2
avrda48.menu.clock.36extclock=36 MHz ext. clock (overclocked)
avrda48.menu.clock.36extclock.build.f_cpu=36000000L
avrda48.menu.clock.36extclock.build.speed=36
avrda48.menu.clock.36extclock.build.clocksource=2
avrda48.menu.clock.40extclock=40 MHz ext. clock (overclocked)
avrda48.menu.clock.40extclock.build.f_cpu=40000000L
avrda48.menu.clock.40extclock.build.speed=40
avrda48.menu.clock.40extclock.build.clocksource=2
avrda48.menu.clock.48extclock=48 MHz ext. clock (WAY overclocked)
avrda48.menu.clock.48extclock.build.f_cpu=48000000L
avrda48.menu.clock.48extclock.build.speed=48
avrda48.menu.clock.48extclock.build.clocksource=2


avrda48.build.adcworkaround=
avrda48.menu.adcworkaround.simple=Simple
avrda48.menu.adcworkaround.simple.build.adcworkaround=-DSIMPLE_ADC_WORKAROUND
avrda48.menu.adcworkaround.none=Startup only


avrda48.menu.bodvoltage.1v9=1.9V
avrda48.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrda48.menu.bodvoltage.2v45=2.45V
avrda48.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrda48.menu.bodvoltage.2v70=2.70V
avrda48.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrda48.menu.bodvoltage.2v85=2.85V
avrda48.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrda48.menu.bodmodeactive.disabled=Disabled
avrda48.menu.bodmodeactive.enabled=Enabled
avrda48.menu.bodmodeactive.sampled=Sampled
avrda48.menu.bodmodeactive.enabledhold=Enabled hold wakeup
avrda48.menu.bodmodesleep.disabled=Disabled
avrda48.menu.bodmodesleep.enabled=Enabled
avrda48.menu.bodmodesleep.sampled=Sampled
avrda48.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
avrda48.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
avrda48.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
avrda48.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
avrda48.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
avrda48.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
avrda48.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10


