SpenceKonde/DxCore/megaavr/boards.txt
avrda48.menu.eesave.enable=EEPROM retained
avrda48.menu.eesave.enable.bootloader.eesavebit=1
avrda48.menu.eesave.disable=EEPROM not retained
avrda48.menu.eesave.disable.bootloader.eesavebit=0

avrda48.menu.resetpin.reset=Hardware Reset (recommended)
avrda48.menu.resetpin.reset.bootloader.resetpinbits=10
avrda48.menu.resetpin.input=Input (no output, ever)
avrda48.menu.resetpin.input.bootloader.resetpinbits=00

avrda48.menu.millis.tcb2=TCB2 (recommended)
avrda48.menu.millis.tca0=TCA0
avrda48.menu.millis.tca1=TCA1
avrda48.menu.millis.tcb0=TCB0 (will break Servo)
avrda48.menu.millis.tcb1=TCB1
avrda48.menu.millis.tcb3=TCB3 (will break tone)
#avrda48.menu.millis.tcd0=TCD0
avrda48.menu.millis.disabled=Disabled

avrda48.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
avrda48.menu.millis.tcb0.build.millistimer=B0
avrda48.menu.millis.tcb1.build.millistimer=B1
avrda48.menu.millis.tcb2.build.millistimer=B2
avrda48.menu.millis.tcb3.build.millistimer=B2
avrda48.menu.millis.tca0.build.millistimer=A0
avrda48.menu.millis.tca1.build.millistimer=A1
#avrda48.menu.millis.tcd0.build.millistimer=D0
avrda48.menu.millis.disabled.build.millistimer=NONE

avrda48.upload.tool=avrdude

avrda48.build.board=avrda48
avrda48.build.core=dxcore
avrda48.build.variant=48pin-standard
avrda48.build.text_section_start=.text=0x0
avrda48.build.extra_flags={build.millis} {build.adcworkaround} -DCLOCK_SOURCE={build.clocksource}
avrda48.build.export_merged_output=false
avrda48.build.mcupostfix=

avrda48.bootloader.tool=avrdude
avrda48.bootloader.WDTCFG=0x00
avrda48.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits}
avrda48.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
avrda48.bootloader.SYSCFG1=0x03
avrda48.bootloader.CODESIZE=0x00
avrda48.bootloader.BOOTSIZE=0x00

avrda48.bootloader.flashcommand=




#########################################
#
#    64 PIN AVR DA-series
#
#########################################


avrda64.name=64-pin AVR DA

avrda64.bootloader.SYSCFG1=0x03

avrda64.menu.chip.128A=AVR128DA64
avrda64.menu.chip.128A.build.mcu=avr128da64
avrda64.menu.chip.128A.upload.maximum_size=131072
avrda64.menu.chip.128A.upload.maximum_data_size=16384
avrda64.menu.chip.64A=AVR64DA64
avrda64.menu.chip.64A.build.mcu=avr64da64
avrda64.menu.chip.64A.upload.maximum_size=65536
avrda64.menu.chip.64A.upload.maximum_data_size=8192


avrda64.menu.clock.24internal=24 MHz internal
avrda64.menu.clock.24internal.build.f_cpu=24000000L
avrda64.menu.clock.24internal.build.speed=24
avrda64.menu.clock.24internal.build.clocksource=0
avrda64.menu.clock.20internal=20 MHz internal
avrda64.menu.clock.20internal.build.f_cpu=20000000L
avrda64.menu.clock.20internal.build.speed=20
avrda64.menu.clock.20internal.build.clocksource=0
avrda64.menu.clock.16internal=16 MHz internal
avrda64.menu.clock.16internal.build.f_cpu=16000000L
avrda64.menu.clock.16internal.build.speed=16
avrda64.menu.clock.16internal.build.clocksource=0
avrda64.menu.clock.12internal=12 MHz internal
avrda64.menu.clock.12internal.build.f_cpu=12000000L
avrda64.menu.clock.12internal.build.speed=12
avrda64.menu.clock.12internal.build.clocksource=0
avrda64.menu.clock.10internal=10 MHz internal
avrda64.menu.clock.10internal.build.f_cpu=10000000L
avrda64.menu.clock.10internal.build.speed=10
avrda64.menu.clock.10internal.build.clocksource=0
avrda64.menu.clock.8internal=8 MHz internal
avrda64.menu.clock.8internal.build.f_cpu=8000000L
avrda64.menu.clock.8internal.build.speed=8
avrda64.menu.clock.8internal.build.clocksource=0
avrda64.menu.clock.4internal=4 MHz internal
avrda64.menu.clock.4internal.build.f_cpu=4000000L
avrda64.menu.clock.4internal.build.speed=4
avrda64.menu.clock.4internal.build.clocksource=0
avrda64.menu.clock.1internal=1 MHz internal
avrda64.menu.clock.1internal.build.f_cpu=1000000L
avrda64.menu.clock.1internal.build.speed=1
avrda64.menu.clock.1internal.build.clocksource=0
avrda64.menu.clock.28internal=28 MHz internal (overclocked)
avrda64.menu.clock.28internal.build.f_cpu=28000000L
avrda64.menu.clock.28internal.build.speed=28
avrda64.menu.clock.28internal.build.clocksource=0
avrda64.menu.clock.32internal=32 MHz internal (overclocked)
avrda64.menu.clock.32internal.build.f_cpu=32000000L
avrda64.menu.clock.32internal.build.speed=32
avrda64.menu.clock.32internal.build.clocksource=0
avrda64.menu.clock.24extclock=24 MHz ext. clock
avrda64.menu.clock.24extclock.build.f_cpu=24000000L
avrda64.menu.clock.24extclock.build.speed=24
avrda64.menu.clock.24extclock.build.clocksource=2
avrda64.menu.clock.20extclock=20 MHz ext. clock
avrda64.menu.clock.20extclock.build.f_cpu=20000000L
avrda64.menu.clock.20extclock.build.speed=20
avrda64.menu.clock.20extclock.build.clocksource=2
avrda64.menu.clock.16extclock=16 MHz ext. clock
avrda64.menu.clock.16extclock.build.f_cpu=16000000L
avrda64.menu.clock.16extclock.build.speed=16
avrda64.menu.clock.16extclock.build.clocksource=2
avrda64.menu.clock.12extclock=12 MHz ext. clock
avrda64.menu.clock.12extclock.build.f_cpu=12000000L
avrda64.menu.clock.12extclock.build.speed=12
avrda64.menu.clock.12extclock.build.clocksource=2
avrda64.menu.clock.8extclock=8 MHz ext. clock
avrda64.menu.clock.8extclock.build.f_cpu=8000000L
avrda64.menu.clock.8extclock.build.speed=8
avrda64.menu.clock.8extclock.build.clocksource=2
avrda64.menu.clock.28extclock=28 MHz ext. clock (overclocked)
avrda64.menu.clock.28extclock.build.f_cpu=28000000L
avrda64.menu.clock.28extclock.build.speed=28
avrda64.menu.clock.28extclock.build.clocksource=2
avrda64.menu.clock.32extclock=32 MHz ext. clock (overclocked)
avrda64.menu.clock.32extclock.build.f_cpu=32000000L
avrda64.menu.clock.32extclock.build.speed=32
avrda64.menu.clock.32extclock.build.clocksource=2
avrda64.menu.clock.36extclock=36 MHz ext. clock (overclocked)
avrda64.menu.clock.36extclock.build.f_cpu=36000000L
avrda64.menu.clock.36extclock.build.speed=36
avrda64.menu.clock.36extclock.build.clocksource=2
avrda64.menu.clock.40extclock=40 MHz ext. clock (overclocked)
avrda64.menu.clock.40extclock.build.f_cpu=40000000L
avrda64.menu.clock.40extclock.build.speed=40
avrda64.menu.clock.40extclock.build.clocksource=2
avrda64.menu.clock.48extclock=48 MHz ext. clock (WAY overclocked)
avrda64.menu.clock.48extclock.build.f_cpu=48000000L
avrda64.menu.clock.48extclock.build.speed=48
avrda64.menu.clock.48extclock.build.clocksource=2


avrda64.build.adcworkaround=
avrda64.menu.adcworkaround.simple=Simple
avrda64.menu.adcworkaround.simple.build.adcworkaround=-DSIMPLE_ADC_WORKAROUND
avrda64.menu.adcworkaround.none=Startup only

avrda64.menu.bodvoltage.1v9=1.9V
avrda64.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrda64.menu.bodvoltage.2v45=2.45V
avrda64.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrda64.menu.bodvoltage.2v70=2.70V
avrda64.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrda64.menu.bodvoltage.2v85=2.85V
avrda64.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrda64.menu.bodmodeactive.disabled=Disabled
avrda64.menu.bodmodeactive.enabled=Enabled
avrda64.menu.bodmodeactive.sampled=Sampled
avrda64.menu.bodmodeactive.enabledhold=Enabled hold wakeup
avrda64.menu.bodmodesleep.disabled=Disabled
avrda64.menu.bodmodesleep.enabled=Enabled
avrda64.menu.bodmodesleep.sampled=Sampled
avrda64.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
avrda64.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
avrda64.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
avrda64.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
avrda64.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
avrda64.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
avrda64.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10


avrda64.menu.eesave.enable=EEPROM retained
avrda64.menu.eesave.enable.bootloader.eesavebit=1
avrda64.menu.eesave.disable=EEPROM not retained
avrda64.menu.eesave.disable.bootloader.eesavebit=0

avrda64.menu.resetpin.reset=Hardware Reset (recommended)
avrda64.menu.resetpin.reset.bootloader.resetpinbits=10
avrda64.menu.resetpin.input=Input (no output, ever)
avrda64.menu.resetpin.input.bootloader.resetpinbits=00

avrda64.menu.millis.tcb2=TCB2 (recommended)
avrda64.menu.millis.tca0=TCA0
avrda64.menu.millis.tca1=TCA1
avrda64.menu.millis.tcb0=TCB0 (will break Servo)
avrda64.menu.millis.tcb1=TCB1
avrda64.menu.millis.tcb3=TCB3 (will break tone)
avrda64.menu.millis.tcb4=TCB4
#avrda64.menu.millis.tcd0=TCD0
avrda64.menu.millis.disabled=Disabled

avrda64.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
avrda64.menu.millis.tcb0.build.millistimer=B0
avrda64.menu.millis.tcb1.build.millistimer=B1
avrda64.menu.millis.tcb2.build.millistimer=B2
avrda64.menu.millis.tcb3.build.millistimer=B3
avrda64.menu.millis.tcb4.build.millistimer=B4
avrda64.menu.millis.tca0.build.millistimer=A0
avrda64.menu.millis.tca1.build.millistimer=A1
#avrda64.menu.millis.tcd0.build.millistimer=D0
avrda64.menu.millis.disabled.build.millistimer=NONE

avrda64.upload.tool=avrdude

avrda64.build.board=avrda64
avrda64.build.core=dxcore
avrda64.build.variant=64pin-standard
avrda64.build.text_section_start=.text=0x0
avrda64.build.extra_flags={build.millis} {build.adcworkaround} -DCLOCK_SOURCE={build.clocksource}
avrda64.build.export_merged_output=false
avrda64.build.mcupostfix=

avrda64.bootloader.tool=avrdude
avrda64.bootloader.WDTCFG=0x00
avrda64.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits}
avrda64.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
avrda64.bootloader.SYSCFG1=0x03
avrda64.bootloader.CODESIZE=0x00
avrda64.bootloader.BOOTSIZE=0x00

