SpenceKonde/DxCore/megaavr/boards.txt
avrda64.bootloader.flashcommand=


#########################################
#
#    28 PIN AVR DA-series
#
#########################################


avrda28opti.name=28-pin AVR DA with Optiboot

avrda28opti.bootloader.SYSCFG1=0x03

avrda28opti.menu.chip.128A=AVR128DA28
avrda28opti.menu.chip.128A.build.mcu=avr128da28
avrda28opti.menu.chip.128A.upload.maximum_size=130048
avrda28opti.menu.chip.128A.upload.maximum_data_size=16384
avrda28opti.menu.chip.128A.bootloader.file=hex/optiboot_dx128
avrda28opti.menu.chip.64A=AVR64DA28
avrda28opti.menu.chip.64A.build.mcu=avr64da28
avrda28opti.menu.chip.64A.upload.maximum_size=64512
avrda28opti.menu.chip.64A.upload.maximum_data_size=8192
avrda28opti.menu.chip.64A.bootloader.file=hex/optiboot_dx32
avrda28opti.menu.chip.32A=AVR32DA28
avrda28opti.menu.chip.32A.build.mcu=avr32da28
avrda28opti.menu.chip.32A.upload.maximum_size=32768
avrda28opti.menu.chip.32A.upload.maximum_data_size=4096
avrda28opti.menu.chip.64A.bootloader.file=hex/optiboot_dx64


avrda28opti.menu.clock.24internal=24 MHz internal
avrda28opti.menu.clock.24internal.build.f_cpu=24000000L
avrda28opti.menu.clock.24internal.build.speed=24
avrda28opti.menu.clock.24internal.build.clocksource=0
avrda28opti.menu.clock.20internal=20 MHz internal
avrda28opti.menu.clock.20internal.build.f_cpu=20000000L
avrda28opti.menu.clock.20internal.build.speed=20
avrda28opti.menu.clock.20internal.build.clocksource=0
avrda28opti.menu.clock.16internal=16 MHz internal
avrda28opti.menu.clock.16internal.build.f_cpu=16000000L
avrda28opti.menu.clock.16internal.build.speed=16
avrda28opti.menu.clock.16internal.build.clocksource=0
avrda28opti.menu.clock.12internal=12 MHz internal
avrda28opti.menu.clock.12internal.build.f_cpu=12000000L
avrda28opti.menu.clock.12internal.build.speed=12
avrda28opti.menu.clock.12internal.build.clocksource=0
avrda28opti.menu.clock.10internal=10 MHz internal
avrda28opti.menu.clock.10internal.build.f_cpu=10000000L
avrda28opti.menu.clock.10internal.build.speed=10
avrda28opti.menu.clock.10internal.build.clocksource=0
avrda28opti.menu.clock.8internal=8 MHz internal
avrda28opti.menu.clock.8internal.build.f_cpu=8000000L
avrda28opti.menu.clock.8internal.build.speed=8
avrda28opti.menu.clock.8internal.build.clocksource=0
avrda28opti.menu.clock.4internal=4 MHz internal
avrda28opti.menu.clock.4internal.build.f_cpu=4000000L
avrda28opti.menu.clock.4internal.build.speed=4
avrda28opti.menu.clock.4internal.build.clocksource=0
avrda28opti.menu.clock.1internal=1 MHz internal
avrda28opti.menu.clock.1internal.build.f_cpu=1000000L
avrda28opti.menu.clock.1internal.build.speed=1
avrda28opti.menu.clock.1internal.build.clocksource=0
avrda28opti.menu.clock.28internal=28 MHz internal (overclocked)
avrda28opti.menu.clock.28internal.build.f_cpu=28000000L
avrda28opti.menu.clock.28internal.build.speed=28
avrda28opti.menu.clock.28internal.build.clocksource=0
avrda28opti.menu.clock.32internal=32 MHz internal (overclocked)
avrda28opti.menu.clock.32internal.build.f_cpu=32000000L
avrda28opti.menu.clock.32internal.build.speed=32
avrda28opti.menu.clock.32internal.build.clocksource=0
avrda28opti.menu.clock.24extclock=24 MHz ext. clock
avrda28opti.menu.clock.24extclock.build.f_cpu=24000000L
avrda28opti.menu.clock.24extclock.build.speed=24
avrda28opti.menu.clock.24extclock.build.clocksource=2
avrda28opti.menu.clock.20extclock=20 MHz ext. clock
avrda28opti.menu.clock.20extclock.build.f_cpu=20000000L
avrda28opti.menu.clock.20extclock.build.speed=20
avrda28opti.menu.clock.20extclock.build.clocksource=2
avrda28opti.menu.clock.16extclock=16 MHz ext. clock
avrda28opti.menu.clock.16extclock.build.f_cpu=16000000L
avrda28opti.menu.clock.16extclock.build.speed=16
avrda28opti.menu.clock.16extclock.build.clocksource=2
avrda28opti.menu.clock.12extclock=12 MHz ext. clock
avrda28opti.menu.clock.12extclock.build.f_cpu=12000000L
avrda28opti.menu.clock.12extclock.build.speed=12
avrda28opti.menu.clock.12extclock.build.clocksource=2
avrda28opti.menu.clock.8extclock=8 MHz ext. clock
avrda28opti.menu.clock.8extclock.build.f_cpu=8000000L
avrda28opti.menu.clock.8extclock.build.speed=8
avrda28opti.menu.clock.8extclock.build.clocksource=2
avrda28opti.menu.clock.28extclock=28 MHz ext. clock (overclocked)
avrda28opti.menu.clock.28extclock.build.f_cpu=28000000L
avrda28opti.menu.clock.28extclock.build.speed=28
avrda28opti.menu.clock.28extclock.build.clocksource=2
avrda28opti.menu.clock.32extclock=32 MHz ext. clock (overclocked)
avrda28opti.menu.clock.32extclock.build.f_cpu=32000000L
avrda28opti.menu.clock.32extclock.build.speed=32
avrda28opti.menu.clock.32extclock.build.clocksource=2
avrda28opti.menu.clock.36extclock=36 MHz ext. clock (overclocked)
avrda28opti.menu.clock.36extclock.build.f_cpu=36000000L
avrda28opti.menu.clock.36extclock.build.speed=36
avrda28opti.menu.clock.36extclock.build.clocksource=2
avrda28opti.menu.clock.40extclock=40 MHz ext. clock (overclocked)
avrda28opti.menu.clock.40extclock.build.f_cpu=40000000L
avrda28opti.menu.clock.40extclock.build.speed=40
avrda28opti.menu.clock.40extclock.build.clocksource=2
avrda28opti.menu.clock.48extclock=48 MHz ext. clock (WAY overclocked)
avrda28opti.menu.clock.48extclock.build.f_cpu=48000000L
avrda28opti.menu.clock.48extclock.build.speed=48
avrda28opti.menu.clock.48extclock.build.clocksource=2

avrda28opti.build.adcworkaround=
avrda28opti.menu.adcworkaround.simple=Enabled
avrda28opti.menu.adcworkaround.simple.build.adcworkaround=-DSIMPLE_ADC_WORKAROUND
avrda28opti.menu.adcworkaround.none=Disabled

avrda28opti.menu.timeout.1sec=1 second (for use w/autoreset)
avrda28opti.menu.timeout.1sec.bootloader.timeout=
avrda28opti.menu.timeout.8sec=8 second (for use w/out autoreset)
avrda28opti.menu.timeout.8sec.bootloader.timeout=_8sec


avrda28opti.menu.bodvoltage.1v9=1.9V
avrda28opti.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrda28opti.menu.bodvoltage.2v45=2.45V
avrda28opti.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrda28opti.menu.bodvoltage.2v70=2.70V
avrda28opti.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrda28opti.menu.bodvoltage.2v85=2.85V
avrda28opti.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrda28opti.menu.bodmodeactive.disabled=Disabled
avrda28opti.menu.bodmodeactive.enabled=Enabled
avrda28opti.menu.bodmodeactive.sampled=Sampled
avrda28opti.menu.bodmodeactive.enabledhold=Enabled hold wakeup
avrda28opti.menu.bodmodesleep.disabled=Disabled
avrda28opti.menu.bodmodesleep.enabled=Enabled
avrda28opti.menu.bodmodesleep.sampled=Sampled
avrda28opti.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
avrda28opti.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
avrda28opti.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
avrda28opti.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
avrda28opti.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
avrda28opti.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
avrda28opti.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10


