SpenceKonde/DxCore/megaavr/boards.txt
avrda28opti.menu.millis.tcb2=TCB2 (recommended)
avrda28opti.menu.millis.tca0=TCA0
avrda28opti.menu.millis.tcb2=TCB0 (will break Servo)
avrda28opti.menu.millis.tcb1=TCB1 (will break tone)
#avrda28opti.menu.millis.tcd0=TCD0
avrda28opti.menu.millis.disabled=Disabled

avrda28opti.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
avrda28opti.menu.millis.tcb0.build.millistimer=B0
avrda28opti.menu.millis.tcb1.build.millistimer=B1
avrda28opti.menu.millis.tcb2.build.millistimer=B2
avrda28opti.menu.millis.tca0.build.millistimer=A0
#avrda28opti.menu.millis.tcd0.build.millistimer=D0
avrda28opti.menu.millis.disabled.build.millistimer=NONE

avrda28opti.upload.tool=avrdude

avrda28opti.build.board=avrda28
avrda28opti.build.core=dxcore
avrda28opti.build.variant=28pin-standard
avrda28opti.build.extra_flags={build.millis} {build.adcworkaround} -DCLOCK_SOURCE={build.clocksource}
avrda28opti.build.export_merged_output=true

avrda28opti.bootloader.tool=avrdude
avrda28opti.bootloader.WDTCFG=0x00
avrda28opti.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits}
avrda28opti.bootloader.SYSCFG0=0xC8
avrda28opti.bootloader.SYSCFG1=0x03
avrda28opti.bootloader.CODESIZE=0x00
avrda28opti.bootloader.BOOTSIZE=0x02

avrda28opti.upload.protocol=arduino
avrda28opti.upload.extra_params=-D
avrda28opti.upload.speed=115200
avrda28opti.build.text_section_start=.text=0x400
avrda28opti.build.mcupostfix=opti
avrda28opti.bootloader.flashcommand=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}{bootloader.port}{bootloader.timeout}.hex:i
avrda28opti.bootloader.tool=avrdude
avrda28opti.menu.bootloaderusart.ser0=USART0, TX PA0 (0), RX PA1 (1)
avrda28opti.menu.bootloaderusart.ser0.bootloader.port=_ser0
avrda28opti.menu.bootloaderusart.ser0_alt=USART0, TX PA4 (4), RX PA5 (5)
avrda28opti.menu.bootloaderusart.ser0_alt.bootloader.port=_ser0_alt
avrda28opti.menu.bootloaderusart.ser1=USART1, TX PC0 (8), RX PC1 (9)
avrda28opti.menu.bootloaderusart.ser1.bootloader.port=_ser1
avrda28opti.menu.bootloaderusart.ser2=USART2, TX PF0 (20), RX PF1 (21)
avrda28opti.menu.bootloaderusart.ser2.bootloader.port=_ser2

#########################################
#
#    32 PIN AVR DA-series Optiboot
#
#########################################


avrda32opti.name=32-pin AVR DA with Optiboot

avrda32opti.bootloader.SYSCFG1=0x03

avrda32opti.menu.chip.128A=AVR128DA32
avrda32opti.menu.chip.128A.build.mcu=avr128da32
avrda32opti.menu.chip.128A.upload.maximum_size=130048
avrda32opti.menu.chip.128A.upload.maximum_data_size=16384
avrda32opti.menu.chip.128A.bootloader.file=hex/optiboot_dx128
avrda32opti.menu.chip.64A=AVR64DA32
avrda32opti.menu.chip.64A.build.mcu=avr64da32
avrda32opti.menu.chip.64A.upload.maximum_size=64512
avrda32opti.menu.chip.64A.upload.maximum_data_size=8192
avrda32opti.menu.chip.64A.bootloader.file=hex/optiboot_dx64
avrda32opti.menu.chip.32A=AVR32DA32
avrda32opti.menu.chip.32A.build.mcu=avr32da32
avrda32opti.menu.chip.32A.upload.maximum_size=31744
avrda32opti.menu.chip.32A.upload.maximum_data_size=4096
avrda32opti.menu.chip.32A.bootloader.file=hex/optiboot_dx32

avrda32opti.menu.clock.24internal=24 MHz internal
avrda32opti.menu.clock.24internal.build.f_cpu=24000000L
avrda32opti.menu.clock.24internal.build.speed=24
avrda32opti.menu.clock.24internal.build.clocksource=0
avrda32opti.menu.clock.20internal=20 MHz internal
avrda32opti.menu.clock.20internal.build.f_cpu=20000000L
avrda32opti.menu.clock.20internal.build.speed=20
avrda32opti.menu.clock.20internal.build.clocksource=0
avrda32opti.menu.clock.16internal=16 MHz internal
avrda32opti.menu.clock.16internal.build.f_cpu=16000000L
avrda32opti.menu.clock.16internal.build.speed=16
avrda32opti.menu.clock.16internal.build.clocksource=0
avrda32opti.menu.clock.12internal=12 MHz internal
avrda32opti.menu.clock.12internal.build.f_cpu=12000000L
avrda32opti.menu.clock.12internal.build.speed=12
avrda32opti.menu.clock.12internal.build.clocksource=0
avrda32opti.menu.clock.10internal=10 MHz internal
avrda32opti.menu.clock.10internal.build.f_cpu=10000000L
avrda32opti.menu.clock.10internal.build.speed=10
avrda32opti.menu.clock.10internal.build.clocksource=0
avrda32opti.menu.clock.8internal=8 MHz internal
avrda32opti.menu.clock.8internal.build.f_cpu=8000000L
avrda32opti.menu.clock.8internal.build.speed=8
avrda32opti.menu.clock.8internal.build.clocksource=0
avrda32opti.menu.clock.4internal=4 MHz internal
avrda32opti.menu.clock.4internal.build.f_cpu=4000000L
avrda32opti.menu.clock.4internal.build.speed=4
avrda32opti.menu.clock.4internal.build.clocksource=0
avrda32opti.menu.clock.1internal=1 MHz internal
avrda32opti.menu.clock.1internal.build.f_cpu=1000000L
avrda32opti.menu.clock.1internal.build.speed=1
avrda32opti.menu.clock.1internal.build.clocksource=0
avrda32opti.menu.clock.28internal=28 MHz internal (overclocked)
avrda32opti.menu.clock.28internal.build.f_cpu=28000000L
avrda32opti.menu.clock.28internal.build.speed=28
avrda32opti.menu.clock.28internal.build.clocksource=0
avrda32opti.menu.clock.32internal=32 MHz internal (overclocked)
avrda32opti.menu.clock.32internal.build.f_cpu=32000000L
avrda32opti.menu.clock.32internal.build.speed=32
avrda32opti.menu.clock.32internal.build.clocksource=0
avrda32opti.menu.clock.24extclock=24 MHz ext. clock
avrda32opti.menu.clock.24extclock.build.f_cpu=24000000L
avrda32opti.menu.clock.24extclock.build.speed=24
avrda32opti.menu.clock.24extclock.build.clocksource=2
avrda32opti.menu.clock.20extclock=20 MHz ext. clock
avrda32opti.menu.clock.20extclock.build.f_cpu=20000000L
avrda32opti.menu.clock.20extclock.build.speed=20
avrda32opti.menu.clock.20extclock.build.clocksource=2
avrda32opti.menu.clock.16extclock=16 MHz ext. clock
avrda32opti.menu.clock.16extclock.build.f_cpu=16000000L
avrda32opti.menu.clock.16extclock.build.speed=16
avrda32opti.menu.clock.16extclock.build.clocksource=2
avrda32opti.menu.clock.12extclock=12 MHz ext. clock
avrda32opti.menu.clock.12extclock.build.f_cpu=12000000L
avrda32opti.menu.clock.12extclock.build.speed=12
avrda32opti.menu.clock.12extclock.build.clocksource=2
avrda32opti.menu.clock.8extclock=8 MHz ext. clock
avrda32opti.menu.clock.8extclock.build.f_cpu=8000000L
avrda32opti.menu.clock.8extclock.build.speed=8
avrda32opti.menu.clock.8extclock.build.clocksource=2
avrda32opti.menu.clock.28extclock=28 MHz ext. clock (overclocked)
avrda32opti.menu.clock.28extclock.build.f_cpu=28000000L
avrda32opti.menu.clock.28extclock.build.speed=28
avrda32opti.menu.clock.28extclock.build.clocksource=2
avrda32opti.menu.clock.32extclock=32 MHz ext. clock (overclocked)
avrda32opti.menu.clock.32extclock.build.f_cpu=32000000L
avrda32opti.menu.clock.32extclock.build.speed=32
avrda32opti.menu.clock.32extclock.build.clocksource=2
avrda32opti.menu.clock.36extclock=36 MHz ext. clock (overclocked)
avrda32opti.menu.clock.36extclock.build.f_cpu=36000000L
avrda32opti.menu.clock.36extclock.build.speed=36
avrda32opti.menu.clock.36extclock.build.clocksource=2
avrda32opti.menu.clock.40extclock=40 MHz ext. clock (overclocked)
avrda32opti.menu.clock.40extclock.build.f_cpu=40000000L
avrda32opti.menu.clock.40extclock.build.speed=40
avrda32opti.menu.clock.40extclock.build.clocksource=2
avrda32opti.menu.clock.48extclock=48 MHz ext. clock (WAY overclocked)
avrda32opti.menu.clock.48extclock.build.f_cpu=48000000L
avrda32opti.menu.clock.48extclock.build.speed=48
avrda32opti.menu.clock.48extclock.build.clocksource=2

avrda32opti.build.adcworkaround=
avrda32opti.menu.adcworkaround.simple=Simple
avrda32opti.menu.adcworkaround.simple.build.adcworkaround=-DSIMPLE_ADC_WORKAROUND
avrda32opti.menu.adcworkaround.none=Startup only
avrda32opti.menu.timeout.1sec=1 second (for use w/autoreset)
avrda32opti.menu.timeout.1sec.bootloader.timeout=
avrda32opti.menu.timeout.8sec=8 second (for use w/out autoreset)
avrda32opti.menu.timeout.8sec.bootloader.timeout=_8sec



avrda32opti.menu.bodvoltage.1v9=1.9V
avrda32opti.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrda32opti.menu.bodvoltage.2v45=2.45V
avrda32opti.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrda32opti.menu.bodvoltage.2v70=2.70V
avrda32opti.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrda32opti.menu.bodvoltage.2v85=2.85V
avrda32opti.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrda32opti.menu.bodmodeactive.disabled=Disabled
avrda32opti.menu.bodmodeactive.enabled=Enabled
avrda32opti.menu.bodmodeactive.sampled=Sampled
avrda32opti.menu.bodmodeactive.enabledhold=Enabled hold wakeup
avrda32opti.menu.bodmodesleep.disabled=Disabled
avrda32opti.menu.bodmodesleep.enabled=Enabled
avrda32opti.menu.bodmodesleep.sampled=Sampled
avrda32opti.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
avrda32opti.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
avrda32opti.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
avrda32opti.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
avrda32opti.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
avrda32opti.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
avrda32opti.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10


avrda32opti.menu.millis.tcb2=TCB2 (recommended)
avrda32opti.menu.millis.tca0=TCA0
avrda32opti.menu.millis.tcb0=TCB0 (will break Servo)
avrda32opti.menu.millis.tcb1=TCB1
#avrda32opti.menu.millis.tcd0=TCD0
avrda32opti.menu.millis.disabled=Disabled

avrda32opti.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
avrda32opti.menu.millis.tcb0.build.millistimer=B0
avrda32opti.menu.millis.tcb1.build.millistimer=B1
avrda32opti.menu.millis.tcb2.build.millistimer=B2
avrda32opti.menu.millis.tca0.build.millistimer=A0
#avrda32opti.menu.millis.tcd0.build.millistimer=D0
avrda32opti.menu.millis.disabled.build.millistimer=NONE

avrda32opti.upload.tool=avrdude

