SpenceKonde/DxCore/megaavr/boards.txt
avrda32opti.build.board=avrda32
avrda32opti.build.core=dxcore
avrda32opti.build.variant=32pin-standard
avrda32opti.build.extra_flags={build.millis} {build.adcworkaround} -DCLOCK_SOURCE={build.clocksource}

avrda32opti.bootloader.tool=avrdude
avrda32opti.bootloader.WDTCFG=0x00
avrda32opti.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits}
avrda32opti.bootloader.SYSCFG0=0xC8
avrda32opti.bootloader.SYSCFG1=0x03
avrda32opti.bootloader.CODESIZE=0x00
avrda32opti.bootloader.BOOTSIZE=0x02

avrda32opti.upload.protocol=arduino
avrda32opti.upload.extra_params=-D
avrda32opti.upload.speed=115200
avrda32opti.build.text_section_start=.text=0x400
avrda32opti.build.mcupostfix=opti
avrda32opti.bootloader.flashcommand=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}{bootloader.port}{bootloader.timeout}.hex:i
avrda32opti.bootloader.tool=avrdude

avrda32opti.menu.bootloaderusart.ser0=USART0, TX PA0 (0), RX PA1 (1)
avrda32opti.menu.bootloaderusart.ser0.bootloader.port=_ser0
avrda32opti.menu.bootloaderusart.ser0_alt=USART0, TX PA4 (4), RX PA5 (5)
avrda32opti.menu.bootloaderusart.ser0_alt.bootloader.port=_ser0_alt
avrda32opti.menu.bootloaderusart.ser1=USART1, TX PC0 (8), RX PC1 (9)
avrda32opti.menu.bootloaderusart.ser1.bootloader.port=_ser1
avrda32opti.menu.bootloaderusart.ser2=USART2, TX PF0 (20), RX PF1 (21)
avrda32opti.menu.bootloaderusart.ser2.bootloader.port=_ser2
avrda32opti.menu.bootloaderusart.ser2_alt=USART2, TX PF4 (24), RX PF5 (25)
avrda32opti.menu.bootloaderusart.ser2_alt.bootloader.port=_ser2_alt

#########################################
#
#    48 PIN AVR DA-series
#
#########################################



avrda48opti.name=48-pin AVR DA with Optiboot
avrda48opti.bootloader.SYSCFG1=0x03

avrda48opti.menu.chip.128A=AVR128DA48
avrda48opti.menu.chip.128A.build.mcu=avr128da48
avrda48opti.menu.chip.128A.upload.maximum_size=130048
avrda48opti.menu.chip.128A.upload.maximum_data_size=16384
avrda48opti.menu.chip.128A.bootloader.file=hex/optiboot_dx128
avrda48opti.menu.chip.64A=AVR64DA48
avrda48opti.menu.chip.64A.build.mcu=avr64da48
avrda48opti.menu.chip.64A.upload.maximum_size=64512
avrda48opti.menu.chip.64A.upload.maximum_data_size=8192
avrda48opti.menu.chip.64A.bootloader.file=hex/optiboot_dx64
avrda48opti.menu.chip.32A=AVR32DA48
avrda48opti.menu.chip.32A.build.mcu=avr32da48
avrda48opti.menu.chip.32A.upload.maximum_size=31744
avrda48opti.menu.chip.32A.upload.maximum_data_size=4096
avrda48opti.menu.chip.32A.bootloader.file=hex/optiboot_dx32


avrda48opti.menu.clock.24internal=24 MHz internal
avrda48opti.menu.clock.24internal.build.f_cpu=24000000L
avrda48opti.menu.clock.24internal.build.speed=24
avrda48opti.menu.clock.24internal.build.clocksource=0
avrda48opti.menu.clock.20internal=20 MHz internal
avrda48opti.menu.clock.20internal.build.f_cpu=20000000L
avrda48opti.menu.clock.20internal.build.speed=20
avrda48opti.menu.clock.20internal.build.clocksource=0
avrda48opti.menu.clock.16internal=16 MHz internal
avrda48opti.menu.clock.16internal.build.f_cpu=16000000L
avrda48opti.menu.clock.16internal.build.speed=16
avrda48opti.menu.clock.16internal.build.clocksource=0
avrda48opti.menu.clock.12internal=12 MHz internal
avrda48opti.menu.clock.12internal.build.f_cpu=12000000L
avrda48opti.menu.clock.12internal.build.speed=12
avrda48opti.menu.clock.12internal.build.clocksource=0
avrda48opti.menu.clock.10internal=10 MHz internal
avrda48opti.menu.clock.10internal.build.f_cpu=10000000L
avrda48opti.menu.clock.10internal.build.speed=10
avrda48opti.menu.clock.10internal.build.clocksource=0
avrda48opti.menu.clock.8internal=8 MHz internal
avrda48opti.menu.clock.8internal.build.f_cpu=8000000L
avrda48opti.menu.clock.8internal.build.speed=8
avrda48opti.menu.clock.8internal.build.clocksource=0
avrda48opti.menu.clock.4internal=4 MHz internal
avrda48opti.menu.clock.4internal.build.f_cpu=4000000L
avrda48opti.menu.clock.4internal.build.speed=4
avrda48opti.menu.clock.4internal.build.clocksource=0
avrda48opti.menu.clock.1internal=1 MHz internal
avrda48opti.menu.clock.1internal.build.f_cpu=1000000L
avrda48opti.menu.clock.1internal.build.speed=1
avrda48opti.menu.clock.1internal.build.clocksource=0
avrda48opti.menu.clock.28internal=28 MHz internal (overclocked)
avrda48opti.menu.clock.28internal.build.f_cpu=28000000L
avrda48opti.menu.clock.28internal.build.speed=28
avrda48opti.menu.clock.28internal.build.clocksource=0
avrda48opti.menu.clock.32internal=32 MHz internal (overclocked)
avrda48opti.menu.clock.32internal.build.f_cpu=32000000L
avrda48opti.menu.clock.32internal.build.speed=32
avrda48opti.menu.clock.32internal.build.clocksource=0
avrda48opti.menu.clock.24extclock=24 MHz ext. clock
avrda48opti.menu.clock.24extclock.build.f_cpu=24000000L
avrda48opti.menu.clock.24extclock.build.speed=24
avrda48opti.menu.clock.24extclock.build.clocksource=2
avrda48opti.menu.clock.20extclock=20 MHz ext. clock
avrda48opti.menu.clock.20extclock.build.f_cpu=20000000L
avrda48opti.menu.clock.20extclock.build.speed=20
avrda48opti.menu.clock.20extclock.build.clocksource=2
avrda48opti.menu.clock.16extclock=16 MHz ext. clock
avrda48opti.menu.clock.16extclock.build.f_cpu=16000000L
avrda48opti.menu.clock.16extclock.build.speed=16
avrda48opti.menu.clock.16extclock.build.clocksource=2
avrda48opti.menu.clock.12extclock=12 MHz ext. clock
avrda48opti.menu.clock.12extclock.build.f_cpu=12000000L
avrda48opti.menu.clock.12extclock.build.speed=12
avrda48opti.menu.clock.12extclock.build.clocksource=2
avrda48opti.menu.clock.8extclock=8 MHz ext. clock
avrda48opti.menu.clock.8extclock.build.f_cpu=8000000L
avrda48opti.menu.clock.8extclock.build.speed=8
avrda48opti.menu.clock.8extclock.build.clocksource=2
avrda48opti.menu.clock.28extclock=28 MHz ext. clock (overclocked)
avrda48opti.menu.clock.28extclock.build.f_cpu=28000000L
avrda48opti.menu.clock.28extclock.build.speed=28
avrda48opti.menu.clock.28extclock.build.clocksource=2
avrda48opti.menu.clock.32extclock=32 MHz ext. clock (overclocked)
avrda48opti.menu.clock.32extclock.build.f_cpu=32000000L
avrda48opti.menu.clock.32extclock.build.speed=32
avrda48opti.menu.clock.32extclock.build.clocksource=2
avrda48opti.menu.clock.36extclock=36 MHz ext. clock (overclocked)
avrda48opti.menu.clock.36extclock.build.f_cpu=36000000L
avrda48opti.menu.clock.36extclock.build.speed=36
avrda48opti.menu.clock.36extclock.build.clocksource=2
avrda48opti.menu.clock.40extclock=40 MHz ext. clock (overclocked)
avrda48opti.menu.clock.40extclock.build.f_cpu=40000000L
avrda48opti.menu.clock.40extclock.build.speed=40
avrda48opti.menu.clock.40extclock.build.clocksource=2
avrda48opti.menu.clock.48extclock=48 MHz ext. clock (WAY overclocked)
avrda48opti.menu.clock.48extclock.build.f_cpu=48000000L
avrda48opti.menu.clock.48extclock.build.speed=48
avrda48opti.menu.clock.48extclock.build.clocksource=2


avrda48opti.build.adcworkaround=
avrda48opti.menu.adcworkaround.simple=Simple
avrda48opti.menu.adcworkaround.simple.build.adcworkaround=-DSIMPLE_ADC_WORKAROUND
avrda48opti.menu.adcworkaround.none=Startup only

