SpenceKonde/DxCore/megaavr/boards.txt
avrda48opti.menu.timeout.1sec=1 second (for use w/autoreset)
avrda48opti.menu.timeout.1sec.bootloader.timeout=
avrda48opti.menu.timeout.8sec=8 second (for use w/out autoreset)
avrda48opti.menu.timeout.8sec.bootloader.timeout=_8sec

avrda48opti.menu.bodvoltage.1v9=1.9V
avrda48opti.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrda48opti.menu.bodvoltage.2v45=2.45V
avrda48opti.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrda48opti.menu.bodvoltage.2v70=2.70V
avrda48opti.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrda48opti.menu.bodvoltage.2v85=2.85V
avrda48opti.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrda48opti.menu.bodmodeactive.disabled=Disabled
avrda48opti.menu.bodmodeactive.enabled=Enabled
avrda48opti.menu.bodmodeactive.sampled=Sampled
avrda48opti.menu.bodmodeactive.enabledhold=Enabled hold wakeup
avrda48opti.menu.bodmodesleep.disabled=Disabled
avrda48opti.menu.bodmodesleep.enabled=Enabled
avrda48opti.menu.bodmodesleep.sampled=Sampled
avrda48opti.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
avrda48opti.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
avrda48opti.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
avrda48opti.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
avrda48opti.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
avrda48opti.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
avrda48opti.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10

avrda48opti.menu.millis.tcb2=TCB2 (recommended)
avrda48opti.menu.millis.tca0=TCA0
avrda48opti.menu.millis.tca1=TCA1
avrda48opti.menu.millis.tcb0=TCB0 (will break Servo)
avrda48opti.menu.millis.tcb1=TCB1
avrda48opti.menu.millis.tcb3=TCB3 (will break tone)
#avrda48opti.menu.millis.tcd0=TCD0
avrda48opti.menu.millis.disabled=Disabled

avrda48opti.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
avrda48opti.menu.millis.tcb0.build.millistimer=B0
avrda48opti.menu.millis.tcb1.build.millistimer=B1
avrda48opti.menu.millis.tcb2.build.millistimer=B2
avrda48opti.menu.millis.tcb3.build.millistimer=B2
avrda48opti.menu.millis.tca0.build.millistimer=A0
avrda48opti.menu.millis.tca1.build.millistimer=A1
#avrda48opti.menu.millis.tcd0.build.millistimer=D0
avrda48opti.menu.millis.disabled.build.millistimer=NONE

avrda48opti.upload.tool=avrdude

avrda48opti.build.board=avrda48
avrda48opti.build.core=dxcore
avrda48opti.build.variant=48pin-standard
avrda48opti.build.extra_flags={build.millis} {build.adcworkaround} -DCLOCK_SOURCE={build.clocksource}
avrda48opti.build.export_merged_output=true

avrda48opti.bootloader.tool=avrdude
avrda48opti.bootloader.WDTCFG=0x00
avrda48opti.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits}
avrda48opti.bootloader.SYSCFG0=0xC8
avrda48opti.bootloader.SYSCFG1=0x03
avrda48opti.bootloader.CODESIZE=0x00
avrda48opti.bootloader.BOOTSIZE=0x02

avrda48opti.upload.protocol=arduino
avrda48opti.upload.extra_params=-D
avrda48opti.upload.speed=115200
avrda48opti.build.text_section_start=.text=0x400
avrda48opti.build.mcupostfix=opti
avrda48opti.bootloader.flashcommand=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}{bootloader.port}{bootloader.timeout}.hex:i
avrda48opti.bootloader.tool=avrdude

avrda48opti.menu.bootloaderusart.ser0=USART0, TX PA0 (0), RX PA1 (1)
avrda48opti.menu.bootloaderusart.ser0.bootloader.port=_ser0
avrda48opti.menu.bootloaderusart.ser0_alt=USART0, TX PA4 (4), RX PA5 (5)
avrda48opti.menu.bootloaderusart.ser0_alt.bootloader.port=_ser0_alt
avrda48opti.menu.bootloaderusart.ser1=USART1, TX PC0 (14), RX PC1 (15)
avrda48opti.menu.bootloaderusart.ser1.bootloader.port=_ser1
avrda48opti.menu.bootloaderusart.ser1_alt=USART1, TX PC4 (18), RX PC5 (19)
avrda48opti.menu.bootloaderusart.ser1_alt.bootloader.port=_ser1_alt
avrda48opti.menu.bootloaderusart.ser2=USART2, TX PF0 (34), RX PF1 (35)
avrda48opti.menu.bootloaderusart.ser2.bootloader.port=_ser2
avrda48opti.menu.bootloaderusart.ser2_alt=USART2, TX PF4 (38), RX PF5 (39)
avrda48opti.menu.bootloaderusart.ser2_alt.bootloader.port=_ser2_alt
avrda48opti.menu.bootloaderusart.ser3=USART3, TX PB0 (8), RX PB1 (9)
avrda48opti.menu.bootloaderusart.ser3.bootloader.port=_ser3
avrda48opti.menu.bootloaderusart.ser3_alt=USART3, TX PB4 (12), RX PB5 (13)
avrda48opti.menu.bootloaderusart.ser3_alt.bootloader.port=_ser3_alt
avrda48opti.menu.bootloaderusart.ser4=USART4, TX PE0 (30), RX PE1 (31)
avrda48opti.menu.bootloaderusart.ser4.bootloader.port=_ser4



#########################################
#
#    64 PIN AVR DA-series
#
#########################################


avrda64opti.name=64-pin AVR DA with Optiboot


avrda64opti.bootloader.SYSCFG1=0x03

avrda64opti.menu.chip.128A=AVR128DA64
avrda64opti.menu.chip.128A.build.mcu=avr128da64
avrda64opti.menu.chip.128A.upload.maximum_size=130048
avrda64opti.menu.chip.128A.upload.maximum_data_size=16384
avrda64opti.menu.chip.128A.bootloader.file=hex/optiboot_dx128
avrda64opti.menu.chip.64A=AVR64DA64
avrda64opti.menu.chip.64A.build.mcu=avr64da64
avrda64opti.menu.chip.64A.upload.maximum_size=64512
avrda64opti.menu.chip.64A.upload.maximum_data_size=8192
avrda64opti.menu.chip.64A.bootloader.file=hex/optiboot_dx64


avrda64opti.menu.clock.24internal=24 MHz internal
avrda64opti.menu.clock.24internal.build.f_cpu=24000000L
avrda64opti.menu.clock.24internal.build.speed=24
avrda64opti.menu.clock.24internal.build.clocksource=0
avrda64opti.menu.clock.20internal=20 MHz internal
avrda64opti.menu.clock.20internal.build.f_cpu=20000000L
avrda64opti.menu.clock.20internal.build.speed=20
avrda64opti.menu.clock.20internal.build.clocksource=0
avrda64opti.menu.clock.16internal=16 MHz internal
avrda64opti.menu.clock.16internal.build.f_cpu=16000000L
avrda64opti.menu.clock.16internal.build.speed=16
avrda64opti.menu.clock.16internal.build.clocksource=0
avrda64opti.menu.clock.12internal=12 MHz internal
avrda64opti.menu.clock.12internal.build.f_cpu=12000000L
avrda64opti.menu.clock.12internal.build.speed=12
avrda64opti.menu.clock.12internal.build.clocksource=0
avrda64opti.menu.clock.10internal=10 MHz internal
avrda64opti.menu.clock.10internal.build.f_cpu=10000000L
avrda64opti.menu.clock.10internal.build.speed=10
avrda64opti.menu.clock.10internal.build.clocksource=0
avrda64opti.menu.clock.8internal=8 MHz internal
avrda64opti.menu.clock.8internal.build.f_cpu=8000000L
avrda64opti.menu.clock.8internal.build.speed=8
avrda64opti.menu.clock.8internal.build.clocksource=0
avrda64opti.menu.clock.4internal=4 MHz internal
avrda64opti.menu.clock.4internal.build.f_cpu=4000000L
avrda64opti.menu.clock.4internal.build.speed=4
avrda64opti.menu.clock.4internal.build.clocksource=0
avrda64opti.menu.clock.1internal=1 MHz internal
avrda64opti.menu.clock.1internal.build.f_cpu=1000000L
avrda64opti.menu.clock.1internal.build.speed=1
avrda64opti.menu.clock.1internal.build.clocksource=0
avrda64opti.menu.clock.28internal=28 MHz internal (overclocked)
avrda64opti.menu.clock.28internal.build.f_cpu=28000000L
avrda64opti.menu.clock.28internal.build.speed=28
avrda64opti.menu.clock.28internal.build.clocksource=0
avrda64opti.menu.clock.32internal=32 MHz internal (overclocked)
avrda64opti.menu.clock.32internal.build.f_cpu=32000000L
avrda64opti.menu.clock.32internal.build.speed=32
avrda64opti.menu.clock.32internal.build.clocksource=0
avrda64opti.menu.clock.24extclock=24 MHz ext. clock
avrda64opti.menu.clock.24extclock.build.f_cpu=24000000L
avrda64opti.menu.clock.24extclock.build.speed=24
avrda64opti.menu.clock.24extclock.build.clocksource=2
avrda64opti.menu.clock.20extclock=20 MHz ext. clock
avrda64opti.menu.clock.20extclock.build.f_cpu=20000000L
avrda64opti.menu.clock.20extclock.build.speed=20
avrda64opti.menu.clock.20extclock.build.clocksource=2
avrda64opti.menu.clock.16extclock=16 MHz ext. clock
avrda64opti.menu.clock.16extclock.build.f_cpu=16000000L
avrda64opti.menu.clock.16extclock.build.speed=16
avrda64opti.menu.clock.16extclock.build.clocksource=2
avrda64opti.menu.clock.12extclock=12 MHz ext. clock
avrda64opti.menu.clock.12extclock.build.f_cpu=12000000L
avrda64opti.menu.clock.12extclock.build.speed=12
avrda64opti.menu.clock.12extclock.build.clocksource=2
avrda64opti.menu.clock.8extclock=8 MHz ext. clock
avrda64opti.menu.clock.8extclock.build.f_cpu=8000000L
avrda64opti.menu.clock.8extclock.build.speed=8
avrda64opti.menu.clock.8extclock.build.clocksource=2
avrda64opti.menu.clock.28extclock=28 MHz ext. clock (overclocked)
avrda64opti.menu.clock.28extclock.build.f_cpu=28000000L
avrda64opti.menu.clock.28extclock.build.speed=28
avrda64opti.menu.clock.28extclock.build.clocksource=2
avrda64opti.menu.clock.32extclock=32 MHz ext. clock (overclocked)
avrda64opti.menu.clock.32extclock.build.f_cpu=32000000L
avrda64opti.menu.clock.32extclock.build.speed=32
avrda64opti.menu.clock.32extclock.build.clocksource=2
avrda64opti.menu.clock.36extclock=36 MHz ext. clock (overclocked)
avrda64opti.menu.clock.36extclock.build.f_cpu=36000000L
avrda64opti.menu.clock.36extclock.build.speed=36
avrda64opti.menu.clock.36extclock.build.clocksource=2
avrda64opti.menu.clock.40extclock=40 MHz ext. clock (overclocked)
avrda64opti.menu.clock.40extclock.build.f_cpu=40000000L
avrda64opti.menu.clock.40extclock.build.speed=40
avrda64opti.menu.clock.40extclock.build.clocksource=2
avrda64opti.menu.clock.48extclock=48 MHz ext. clock (WAY overclocked)
avrda64opti.menu.clock.48extclock.build.f_cpu=48000000L
avrda64opti.menu.clock.48extclock.build.speed=48
avrda64opti.menu.clock.48extclock.build.clocksource=2


avrda64opti.build.adcworkaround=
avrda64opti.menu.adcworkaround.simple=Simple
avrda64opti.menu.adcworkaround.simple.build.adcworkaround=-DSIMPLE_ADC_WORKAROUND
avrda64opti.menu.adcworkaround.none=Startup only

