SpenceKonde/DxCore/megaavr/boards.txt
avrda64opti.menu.timeout.1sec=1 second (for use w/autoreset)
avrda64opti.menu.timeout.1sec.bootloader.timeout=
avrda64opti.menu.timeout.8sec=8 second (for use w/out autoreset)
avrda64opti.menu.timeout.8sec.bootloader.timeout=_8sec

avrda64opti.menu.bodvoltage.1v9=1.9V
avrda64opti.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrda64opti.menu.bodvoltage.2v45=2.45V
avrda64opti.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrda64opti.menu.bodvoltage.2v70=2.70V
avrda64opti.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrda64opti.menu.bodvoltage.2v85=2.85V
avrda64opti.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrda64opti.menu.bodmodeactive.disabled=Disabled
avrda64opti.menu.bodmodeactive.enabled=Enabled
avrda64opti.menu.bodmodeactive.sampled=Sampled
avrda64opti.menu.bodmodeactive.enabledhold=Enabled hold wakeup
avrda64opti.menu.bodmodesleep.disabled=Disabled
avrda64opti.menu.bodmodesleep.enabled=Enabled
avrda64opti.menu.bodmodesleep.sampled=Sampled
avrda64opti.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
avrda64opti.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
avrda64opti.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
avrda64opti.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
avrda64opti.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
avrda64opti.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
avrda64opti.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10



avrda64opti.menu.millis.tcb2=TCB2 (recommended)
avrda64opti.menu.millis.tca0=TCA0
avrda64opti.menu.millis.tca1=TCA1
avrda64opti.menu.millis.tcb0=TCB0 (will break Servo)
avrda64opti.menu.millis.tcb1=TCB1
avrda64opti.menu.millis.tcb3=TCB3 (will break tone)
avrda64opti.menu.millis.tcb4=TCB4
#avrda64opti.menu.millis.tcd0=TCD0
avrda64opti.menu.millis.disabled=Disabled

avrda64opti.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
avrda64opti.menu.millis.tcb0.build.millistimer=B0
avrda64opti.menu.millis.tcb1.build.millistimer=B1
avrda64opti.menu.millis.tcb2.build.millistimer=B2
avrda64opti.menu.millis.tcb3.build.millistimer=B3
avrda64opti.menu.millis.tcb4.build.millistimer=B4
avrda64opti.menu.millis.tca0.build.millistimer=A0
avrda64opti.menu.millis.tca1.build.millistimer=A1
#avrda64opti.menu.millis.tcd0.build.millistimer=D0
avrda64opti.menu.millis.disabled.build.millistimer=NONE

avrda64opti.upload.tool=avrdude

avrda64opti.build.board=avrda64
avrda64opti.build.core=dxcore
avrda64opti.build.variant=64pin-standard
avrda64opti.build.extra_flags={build.millis} {build.adcworkaround} -DCLOCK_SOURCE={build.clocksource}
avrda64opti.build.export_merged_output=true

avrda64opti.bootloader.tool=avrdude
avrda64opti.bootloader.WDTCFG=0x00
avrda64opti.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits}
avrda64opti.bootloader.SYSCFG0=0xC8
avrda64opti.bootloader.CODESIZE=0x00
avrda64opti.bootloader.BOOTSIZE=0x02

avrda64opti.upload.protocol=arduino
avrda64opti.upload.extra_params=-D
avrda64opti.upload.speed=115200
avrda64opti.build.text_section_start=.text=0x400
avrda64opti.build.mcupostfix=opti
avrda64opti.bootloader.flashcommand=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}{bootloader.port}{bootloader.timeout}.hex:i
avrda64opti.bootloader.tool=avrdude

avrda64opti.menu.bootloaderusart.ser0=USART0, TX PA0 (0), RX PA1 (1)
avrda64opti.menu.bootloaderusart.ser0.bootloader.port=_ser0
avrda64opti.menu.bootloaderusart.ser0_alt=USART0, TX PA4 (4), RX PA5 (5)
avrda64opti.menu.bootloaderusart.ser0_alt.bootloader.port=_ser0_alt
avrda64opti.menu.bootloaderusart.ser1=USART1, TX PC0 (16), RX PC1 (17)
avrda64opti.menu.bootloaderusart.ser1.bootloader.port=_ser1
avrda64opti.menu.bootloaderusart.ser1_alt=USART1, TX PC4 (20), RX PC5 (21)
avrda64opti.menu.bootloaderusart.ser1_alt.bootloader.port=_ser1_alt
avrda64opti.menu.bootloaderusart.ser2=USART2, TX PF0 (40), RX PF1 (41)
avrda64opti.menu.bootloaderusart.ser2.bootloader.port=_ser2
avrda64opti.menu.bootloaderusart.ser2_alt=USART2, TX PF4 (44), RX PF5 (45)
avrda64opti.menu.bootloaderusart.ser2_alt.bootloader.port=_ser2_alt
avrda64opti.menu.bootloaderusart.ser3=USART3, TX PB0 (8), RX PB1 (9)
avrda64opti.menu.bootloaderusart.ser3.bootloader.port=_ser3
avrda64opti.menu.bootloaderusart.ser3_alt=USART3, TX PB4 (12), RX PB5 (13)
avrda64opti.menu.bootloaderusart.ser3_alt.bootloader.port=_ser3_alt
avrda64opti.menu.bootloaderusart.ser4=USART4, TX PE0 (32), RX PE1 (33)
avrda64opti.menu.bootloaderusart.ser4.bootloader.port=_ser4
avrda64opti.menu.bootloaderusart.ser4_alt=USART4, TX PE4 (36), RX PE5 (37)
avrda64opti.menu.bootloaderusart.ser4_alt.bootloader.port=_ser4_alt
avrda64opti.menu.bootloaderusart.ser5=USART5, TX PG0 (46), RX PG1 (47)
avrda64opti.menu.bootloaderusart.ser5.bootloader.port=_ser5
avrda64opti.menu.bootloaderusart.ser5_alt=USART5, TX PG4 (50), RX PG5 (51)
avrda64opti.menu.bootloaderusart.ser5_alt.bootloader.port=_ser5_alt




#########################################
#
#    28 PIN AVR DB-series
#
#########################################


avrdb28.name=28-pin AVR DB


avrdb28.menu.chip.128B=AVR128DB28
avrdb28.menu.chip.128B.build.mcu=avr128db28
avrdb28.menu.chip.128B.upload.maximum_size=131072
avrdb28.menu.chip.128B.upload.maximum_data_size=16384
#avrdb28.menu.chip.64B=AVR64DB28
#avrdb28.menu.chip.64B.build.mcu=avr64db28
#avrdb28.menu.chip.64B.upload.maximum_size=65536
#avrdb28.menu.chip.64B.upload.maximum_data_size=8192
#avrdb28.menu.chip.32B=AVR32DB28
#avrdb28.menu.chip.32B.build.mcu=avr32db28
#avrdb28.menu.chip.32B.upload.maximum_size=32768
#avrdb28.menu.chip.32B.upload.maximum_data_size=4096


avrdb28.menu.clock.24internal=24 MHz internal
avrdb28.menu.clock.24internal.build.f_cpu=24000000L
avrdb28.menu.clock.24internal.build.speed=24
avrdb28.menu.clock.24internal.build.clocksource=0
avrdb28.menu.clock.20internal=20 MHz internal
avrdb28.menu.clock.20internal.build.f_cpu=20000000L
avrdb28.menu.clock.20internal.build.speed=20
avrdb28.menu.clock.20internal.build.clocksource=0
avrdb28.menu.clock.16internal=16 MHz internal
avrdb28.menu.clock.16internal.build.f_cpu=16000000L
avrdb28.menu.clock.16internal.build.speed=16
avrdb28.menu.clock.16internal.build.clocksource=0
avrdb28.menu.clock.12internal=12 MHz internal
avrdb28.menu.clock.12internal.build.f_cpu=12000000L
avrdb28.menu.clock.12internal.build.speed=12
avrdb28.menu.clock.12internal.build.clocksource=0
avrdb28.menu.clock.10internal=10 MHz internal
avrdb28.menu.clock.10internal.build.f_cpu=10000000L
avrdb28.menu.clock.10internal.build.speed=10
avrdb28.menu.clock.10internal.build.clocksource=0
avrdb28.menu.clock.8internal=8 MHz internal
avrdb28.menu.clock.8internal.build.f_cpu=8000000L
avrdb28.menu.clock.8internal.build.speed=8
avrdb28.menu.clock.8internal.build.clocksource=0
avrdb28.menu.clock.4internal=4 MHz internal
avrdb28.menu.clock.4internal.build.f_cpu=4000000L
avrdb28.menu.clock.4internal.build.speed=4
avrdb28.menu.clock.4internal.build.clocksource=0
avrdb28.menu.clock.1internal=1 MHz internal
avrdb28.menu.clock.1internal.build.f_cpu=1000000L
avrdb28.menu.clock.1internal.build.speed=1
avrdb28.menu.clock.1internal.build.clocksource=0
avrdb28.menu.clock.28internal=28 MHz internal (overclocked)
avrdb28.menu.clock.28internal.build.f_cpu=28000000L
avrdb28.menu.clock.28internal.build.speed=28
avrdb28.menu.clock.28internal.build.clocksource=0
avrdb28.menu.clock.32internal=32 MHz internal (overclocked)
avrdb28.menu.clock.32internal.build.f_cpu=32000000L
avrdb28.menu.clock.32internal.build.speed=32
avrdb28.menu.clock.32internal.build.clocksource=0
avrdb28.menu.clock.24crystal=24 MHz crystal
avrdb28.menu.clock.24crystal.build.f_cpu=24000000L
avrdb28.menu.clock.24crystal.build.speed=24
avrdb28.menu.clock.24crystal.build.clocksource=1
avrdb28.menu.clock.20crystal=20 MHz crystal
avrdb28.menu.clock.20crystal.build.f_cpu=20000000L
avrdb28.menu.clock.20crystal.build.speed=20
avrdb28.menu.clock.20crystal.build.clocksource=1
avrdb28.menu.clock.16crystal=16 MHz crystal
avrdb28.menu.clock.16crystal.build.f_cpu=16000000L
avrdb28.menu.clock.16crystal.build.speed=16
avrdb28.menu.clock.16crystal.build.clocksource=1
avrdb28.menu.clock.12crystal=12 MHz crystal
avrdb28.menu.clock.12crystal.build.f_cpu=12000000L
avrdb28.menu.clock.12crystal.build.speed=12
avrdb28.menu.clock.12crystal.build.clocksource=1
avrdb28.menu.clock.8crystal=8 MHz crystal
avrdb28.menu.clock.8crystal.build.f_cpu=8000000L
avrdb28.menu.clock.8crystal.build.speed=8
avrdb28.menu.clock.8crystal.build.clocksource=1
avrdb28.menu.clock.28crystal=28 MHz crystal (overclocked)
avrdb28.menu.clock.28crystal.build.f_cpu=28000000L
avrdb28.menu.clock.28crystal.build.speed=28
avrdb28.menu.clock.28crystal.build.clocksource=1
avrdb28.menu.clock.32crystal=32 MHz crystal (overclocked)
avrdb28.menu.clock.32crystal.build.f_cpu=32000000L
avrdb28.menu.clock.32crystal.build.speed=32
avrdb28.menu.clock.32crystal.build.clocksource=1
avrdb28.menu.clock.36crystal=36 MHz crystal (overclocked)
avrdb28.menu.clock.36crystal.build.f_cpu=36000000L
avrdb28.menu.clock.36crystal.build.speed=36
avrdb28.menu.clock.36crystal.build.clocksource=1
avrdb28.menu.clock.40crystal=40 MHz crystal (overclocked)
avrdb28.menu.clock.40crystal.build.f_cpu=40000000L
avrdb28.menu.clock.40crystal.build.speed=40
avrdb28.menu.clock.40crystal.build.clocksource=1
avrdb28.menu.clock.24extclock=24 MHz ext. clock
avrdb28.menu.clock.24extclock.build.f_cpu=24000000L
avrdb28.menu.clock.24extclock.build.speed=24
avrdb28.menu.clock.24extclock.build.clocksource=2
avrdb28.menu.clock.20extclock=20 MHz ext. clock
avrdb28.menu.clock.20extclock.build.f_cpu=20000000L
avrdb28.menu.clock.20extclock.build.speed=20
avrdb28.menu.clock.20extclock.build.clocksource=2
avrdb28.menu.clock.16extclock=16 MHz ext. clock
avrdb28.menu.clock.16extclock.build.f_cpu=16000000L
avrdb28.menu.clock.16extclock.build.speed=16
avrdb28.menu.clock.16extclock.build.clocksource=2
avrdb28.menu.clock.12extclock=12 MHz ext. clock
avrdb28.menu.clock.12extclock.build.f_cpu=12000000L
avrdb28.menu.clock.12extclock.build.speed=12
avrdb28.menu.clock.12extclock.build.clocksource=2
avrdb28.menu.clock.8extclock=8 MHz ext. clock
avrdb28.menu.clock.8extclock.build.f_cpu=8000000L
avrdb28.menu.clock.8extclock.build.speed=8
avrdb28.menu.clock.8extclock.build.clocksource=2
avrdb28.menu.clock.28extclock=28 MHz ext. clock (overclocked)
avrdb28.menu.clock.28extclock.build.f_cpu=28000000L
avrdb28.menu.clock.28extclock.build.speed=28
avrdb28.menu.clock.28extclock.build.clocksource=2
avrdb28.menu.clock.32extclock=32 MHz ext. clock (overclocked)
avrdb28.menu.clock.32extclock.build.f_cpu=32000000L
avrdb28.menu.clock.32extclock.build.speed=32
avrdb28.menu.clock.32extclock.build.clocksource=2
avrdb28.menu.clock.36extclock=36 MHz ext. clock (overclocked)
avrdb28.menu.clock.36extclock.build.f_cpu=36000000L
avrdb28.menu.clock.36extclock.build.speed=36
avrdb28.menu.clock.36extclock.build.clocksource=2
avrdb28.menu.clock.40extclock=40 MHz ext. clock (overclocked)
avrdb28.menu.clock.40extclock.build.f_cpu=40000000L
avrdb28.menu.clock.40extclock.build.speed=40
avrdb28.menu.clock.40extclock.build.clocksource=2
avrdb28.menu.clock.48extclock=48 MHz ext. clock (WAY overclocked)
avrdb28.menu.clock.48extclock.build.f_cpu=48000000L
avrdb28.menu.clock.48extclock.build.speed=48
avrdb28.menu.clock.48extclock.build.clocksource=2





avrdb28.menu.mvio.enabled=Enabled
avrdb28.menu.mvio.enabled.bootloader.SYSCFG1=0x0B
avrdb28.menu.mvio.disabled=Disabled
avrdb28.menu.mvio.disabled.bootloader.SYSCFG1=0x13


avrdb28.menu.bodvoltage.1v9=1.9V
avrdb28.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrdb28.menu.bodvoltage.2v45=2.45V
avrdb28.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrdb28.menu.bodvoltage.2v70=2.70V
avrdb28.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrdb28.menu.bodvoltage.2v85=2.85V
avrdb28.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrdb28.menu.bodmodeactive.disabled=Disabled
avrdb28.menu.bodmodeactive.enabled=Enabled
avrdb28.menu.bodmodeactive.sampled=Sampled
avrdb28.menu.bodmodeactive.enabledhold=Enabled hold wakeup
avrdb28.menu.bodmodesleep.disabled=Disabled
avrdb28.menu.bodmodesleep.enabled=Enabled
avrdb28.menu.bodmodesleep.sampled=Sampled
avrdb28.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
avrdb28.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
avrdb28.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
avrdb28.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
avrdb28.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
avrdb28.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
avrdb28.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10


avrdb28.menu.eesave.enable=EEPROM retained
avrdb28.menu.eesave.enable.bootloader.eesavebit=1
avrdb28.menu.eesave.disable=EEPROM not retained
avrdb28.menu.eesave.disable.bootloader.eesavebit=0

avrdb28.menu.resetpin.reset=Hardware Reset (recommended)
avrdb28.menu.resetpin.reset.bootloader.resetpinbits=10
avrdb28.menu.resetpin.input=Input (no output, ever)
avrdb28.menu.resetpin.input.bootloader.resetpinbits=00

