SpenceKonde/DxCore/megaavr/boards.txt
avrdb28.menu.millis.tcb2=TCB2 (recommended)
avrdb28.menu.millis.tca0=TCA0
avrdb28.menu.millis.tcb0=TCB0 (will break Servo)
avrdb28.menu.millis.tcb1=TCB1 (will break tone)
#avrdb28.menu.millis.tcd0=TCD0
avrdb28.menu.millis.disabled=Disabled

avrdb28.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
avrdb28.menu.millis.tcb0.build.millistimer=B0
avrdb28.menu.millis.tcb1.build.millistimer=B1
avrdb28.menu.millis.tcb2.build.millistimer=B2
avrdb28.menu.millis.tca0.build.millistimer=A0
#avrdb28.menu.millis.tcd0.build.millistimer=D0
avrdb28.menu.millis.disabled.build.millistimer=NONE

avrdb28.upload.tool=avrdude

avrdb28.build.board=avrdb28
avrdb28.build.core=dxcore
avrdb28.build.variant=28pin-standard
avrdb28.build.text_section_start=.text=0x0
avrdb28.build.extra_flags={build.millis} -DCLOCK_SOURCE={build.clocksource}

avrdb28.build.export_merged_output=false
avrdb28.build.mcupostfix=

avrdb28.bootloader.tool=avrdude
avrdb28.bootloader.WDTCFG=0x00
avrdb28.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits}
avrdb28.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
avrdb28.bootloader.CODESIZE=0x00
avrdb28.bootloader.BOOTSIZE=0x00

avrdb28.bootloader.flashcommand=



#########################################
#
#    32 PIN AVR DB-series
#
#########################################


avrdb32.name=32-pin AVR DB


avrdb32.menu.chip.128B=AVR128DB32
avrdb32.menu.chip.128B.build.mcu=avr128db32
avrdb32.menu.chip.128B.upload.maximum_size=131072
avrdb32.menu.chip.128B.upload.maximum_data_size=16384
#avrdb32.menu.chip.64B=AVR64DB32
#avrdb32.menu.chip.64B.build.mcu=avr64db32
#avrdb32.menu.chip.64B.upload.maximum_size=65536
#avrdb32.menu.chip.64B.upload.maximum_data_size=8192
#avrdb32.menu.chip.32B=AVR32DB32
#avrdb32.menu.chip.32B.build.mcu=avr32db32
#avrdb32.menu.chip.32B.upload.maximum_size=32768
#avrdb32.menu.chip.32B.upload.maximum_data_size=4096


avrdb32.menu.clock.24internal=24 MHz internal
avrdb32.menu.clock.24internal.build.f_cpu=24000000L
avrdb32.menu.clock.24internal.build.speed=24
avrdb32.menu.clock.24internal.build.clocksource=0
avrdb32.menu.clock.20internal=20 MHz internal
avrdb32.menu.clock.20internal.build.f_cpu=20000000L
avrdb32.menu.clock.20internal.build.speed=20
avrdb32.menu.clock.20internal.build.clocksource=0
avrdb32.menu.clock.16internal=16 MHz internal
avrdb32.menu.clock.16internal.build.f_cpu=16000000L
avrdb32.menu.clock.16internal.build.speed=16
avrdb32.menu.clock.16internal.build.clocksource=0
avrdb32.menu.clock.12internal=12 MHz internal
avrdb32.menu.clock.12internal.build.f_cpu=12000000L
avrdb32.menu.clock.12internal.build.speed=12
avrdb32.menu.clock.12internal.build.clocksource=0
avrdb32.menu.clock.10internal=10 MHz internal
avrdb32.menu.clock.10internal.build.f_cpu=10000000L
avrdb32.menu.clock.10internal.build.speed=10
avrdb32.menu.clock.10internal.build.clocksource=0
avrdb32.menu.clock.8internal=8 MHz internal
avrdb32.menu.clock.8internal.build.f_cpu=8000000L
avrdb32.menu.clock.8internal.build.speed=8
avrdb32.menu.clock.8internal.build.clocksource=0
avrdb32.menu.clock.4internal=4 MHz internal
avrdb32.menu.clock.4internal.build.f_cpu=4000000L
avrdb32.menu.clock.4internal.build.speed=4
avrdb32.menu.clock.4internal.build.clocksource=0
avrdb32.menu.clock.1internal=1 MHz internal
avrdb32.menu.clock.1internal.build.f_cpu=1000000L
avrdb32.menu.clock.1internal.build.speed=1
avrdb32.menu.clock.1internal.build.clocksource=0
avrdb32.menu.clock.28internal=28 MHz internal (overclocked)
avrdb32.menu.clock.28internal.build.f_cpu=28000000L
avrdb32.menu.clock.28internal.build.speed=28
avrdb32.menu.clock.28internal.build.clocksource=0
avrdb32.menu.clock.32internal=32 MHz internal (overclocked)
avrdb32.menu.clock.32internal.build.f_cpu=32000000L
avrdb32.menu.clock.32internal.build.speed=32
avrdb32.menu.clock.32internal.build.clocksource=0
avrdb32.menu.clock.24crystal=24 MHz crystal
avrdb32.menu.clock.24crystal.build.f_cpu=24000000L
avrdb32.menu.clock.24crystal.build.speed=24
avrdb32.menu.clock.24crystal.build.clocksource=1
avrdb32.menu.clock.20crystal=20 MHz crystal
avrdb32.menu.clock.20crystal.build.f_cpu=20000000L
avrdb32.menu.clock.20crystal.build.speed=20
avrdb32.menu.clock.20crystal.build.clocksource=1
avrdb32.menu.clock.16crystal=16 MHz crystal
avrdb32.menu.clock.16crystal.build.f_cpu=16000000L
avrdb32.menu.clock.16crystal.build.speed=16
avrdb32.menu.clock.16crystal.build.clocksource=1
avrdb32.menu.clock.12crystal=12 MHz crystal
avrdb32.menu.clock.12crystal.build.f_cpu=12000000L
avrdb32.menu.clock.12crystal.build.speed=12
avrdb32.menu.clock.12crystal.build.clocksource=1
avrdb32.menu.clock.8crystal=8 MHz crystal
avrdb32.menu.clock.8crystal.build.f_cpu=8000000L
avrdb32.menu.clock.8crystal.build.speed=8
avrdb32.menu.clock.8crystal.build.clocksource=1
avrdb32.menu.clock.28crystal=28 MHz crystal (overclocked)
avrdb32.menu.clock.28crystal.build.f_cpu=28000000L
avrdb32.menu.clock.28crystal.build.speed=28
avrdb32.menu.clock.28crystal.build.clocksource=1
avrdb32.menu.clock.32crystal=32 MHz crystal (overclocked)
avrdb32.menu.clock.32crystal.build.f_cpu=32000000L
avrdb32.menu.clock.32crystal.build.speed=32
avrdb32.menu.clock.32crystal.build.clocksource=1
avrdb32.menu.clock.36crystal=36 MHz crystal (overclocked)
avrdb32.menu.clock.36crystal.build.f_cpu=36000000L
avrdb32.menu.clock.36crystal.build.speed=36
avrdb32.menu.clock.36crystal.build.clocksource=1
avrdb32.menu.clock.40crystal=40 MHz crystal (overclocked)
avrdb32.menu.clock.40crystal.build.f_cpu=40000000L
avrdb32.menu.clock.40crystal.build.speed=40
avrdb32.menu.clock.40crystal.build.clocksource=1
avrdb32.menu.clock.24extclock=24 MHz ext. clock
avrdb32.menu.clock.24extclock.build.f_cpu=24000000L
avrdb32.menu.clock.24extclock.build.speed=24
avrdb32.menu.clock.24extclock.build.clocksource=2
avrdb32.menu.clock.20extclock=20 MHz ext. clock
avrdb32.menu.clock.20extclock.build.f_cpu=20000000L
avrdb32.menu.clock.20extclock.build.speed=20
avrdb32.menu.clock.20extclock.build.clocksource=2
avrdb32.menu.clock.16extclock=16 MHz ext. clock
avrdb32.menu.clock.16extclock.build.f_cpu=16000000L
avrdb32.menu.clock.16extclock.build.speed=16
avrdb32.menu.clock.16extclock.build.clocksource=2
avrdb32.menu.clock.12extclock=12 MHz ext. clock
avrdb32.menu.clock.12extclock.build.f_cpu=12000000L
avrdb32.menu.clock.12extclock.build.speed=12
avrdb32.menu.clock.12extclock.build.clocksource=2
avrdb32.menu.clock.8extclock=8 MHz ext. clock
avrdb32.menu.clock.8extclock.build.f_cpu=8000000L
avrdb32.menu.clock.8extclock.build.speed=8
avrdb32.menu.clock.8extclock.build.clocksource=2
avrdb32.menu.clock.28extclock=28 MHz ext. clock (overclocked)
avrdb32.menu.clock.28extclock.build.f_cpu=28000000L
avrdb32.menu.clock.28extclock.build.speed=28
avrdb32.menu.clock.28extclock.build.clocksource=2
avrdb32.menu.clock.32extclock=32 MHz ext. clock (overclocked)
avrdb32.menu.clock.32extclock.build.f_cpu=32000000L
avrdb32.menu.clock.32extclock.build.speed=32
avrdb32.menu.clock.32extclock.build.clocksource=2
avrdb32.menu.clock.36extclock=36 MHz ext. clock (overclocked)
avrdb32.menu.clock.36extclock.build.f_cpu=36000000L
avrdb32.menu.clock.36extclock.build.speed=36
avrdb32.menu.clock.36extclock.build.clocksource=2
avrdb32.menu.clock.40extclock=40 MHz ext. clock (overclocked)
avrdb32.menu.clock.40extclock.build.f_cpu=40000000L
avrdb32.menu.clock.40extclock.build.speed=40
avrdb32.menu.clock.40extclock.build.clocksource=2
avrdb32.menu.clock.48extclock=48 MHz ext. clock (WAY overclocked)
avrdb32.menu.clock.48extclock.build.f_cpu=48000000L
avrdb32.menu.clock.48extclock.build.speed=48
avrdb32.menu.clock.48extclock.build.clocksource=2






avrdb32.menu.mvio.enabled=Enabled
avrdb32.menu.mvio.enabled.bootloader.SYSCFG1=0x0B
avrdb32.menu.mvio.disabled=Disabled
avrdb32.menu.mvio.disabled.bootloader.SYSCFG1=0x13


