SpenceKonde/DxCore/megaavr/boards.txt
avrdb48.menu.mvio.enabled=Enabled
avrdb48.menu.mvio.enabled.bootloader.SYSCFG1=0x0B
avrdb48.menu.mvio.disabled=Disabled
avrdb48.menu.mvio.disabled.bootloader.SYSCFG1=0x13


avrdb48.menu.bodvoltage.1v9=1.9V
avrdb48.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrdb48.menu.bodvoltage.2v45=2.45V
avrdb48.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrdb48.menu.bodvoltage.2v70=2.70V
avrdb48.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrdb48.menu.bodvoltage.2v85=2.85V
avrdb48.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrdb48.menu.bodmodeactive.disabled=Disabled
avrdb48.menu.bodmodeactive.enabled=Enabled
avrdb48.menu.bodmodeactive.sampled=Sampled
avrdb48.menu.bodmodeactive.enabledhold=Enabled hold wakeup
avrdb48.menu.bodmodesleep.disabled=Disabled
avrdb48.menu.bodmodesleep.enabled=Enabled
avrdb48.menu.bodmodesleep.sampled=Sampled
avrdb48.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
avrdb48.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
avrdb48.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
avrdb48.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
avrdb48.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
avrdb48.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
avrdb48.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10


avrdb48.menu.eesave.enable=EEPROM retained
avrdb48.menu.eesave.enable.bootloader.eesavebit=1
avrdb48.menu.eesave.disable=EEPROM not retained
avrdb48.menu.eesave.disable.bootloader.eesavebit=0

avrdb48.menu.resetpin.reset=Hardware Reset (recommended)
avrdb48.menu.resetpin.reset.bootloader.resetpinbits=10
avrdb48.menu.resetpin.input=Input (no output, ever)
avrdb48.menu.resetpin.input.bootloader.resetpinbits=00

avrdb48.menu.millis.tcb2=TCB2 (recommended)
avrdb48.menu.millis.tca0=TCA0
avrdb48.menu.millis.tca1=TCA1
avrdb48.menu.millis.tcb0=TCB0 (will break Servo)
avrdb48.menu.millis.tcb1=TCB1
avrdb48.menu.millis.tcb3=TCB3 (will break tone)
#avrdb48.menu.millis.tcd0=TCD0
avrdb48.menu.millis.disabled=Disabled

avrdb48.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
avrdb48.menu.millis.tcb0.build.millistimer=B0
avrdb48.menu.millis.tcb1.build.millistimer=B1
avrdb48.menu.millis.tcb2.build.millistimer=B2
avrdb48.menu.millis.tcb3.build.millistimer=B2
avrdb48.menu.millis.tca0.build.millistimer=A0
avrdb48.menu.millis.tca1.build.millistimer=A1
#avrdb48.menu.millis.tcd0.build.millistimer=D0
avrdb48.menu.millis.disabled.build.millistimer=NONE

avrdb48.upload.tool=avrdude

avrdb48.build.board=avrdb48
avrdb48.build.core=dxcore
avrdb48.build.variant=48pin-standard
avrdb48.build.text_section_start=.text=0x0
avrdb48.build.extra_flags={build.millis} -DCLOCK_SOURCE={build.clocksource}

avrdb48.build.export_merged_output=false
avrdb48.build.mcupostfix=

avrdb48.bootloader.tool=avrdude
avrdb48.bootloader.WDTCFG=0x00
avrdb48.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits}
avrdb48.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
avrdb48.bootloader.CODESIZE=0x00
avrdb48.bootloader.BOOTSIZE=0x00

avrdb48.bootloader.flashcommand=




#########################################
#
#    64 PIN AVR DB-series
#
#########################################


avrdb64.name=64-pin AVR DB


avrdb64.menu.chip.128B=AVR128DB64
avrdb64.menu.chip.128B.build.mcu=avr128db64
avrdb64.menu.chip.128B.upload.maximum_size=131072
avrdb64.menu.chip.128B.upload.maximum_data_size=16384
#avrdb64.menu.chip.64B=AVR64DB64
#avrdb64.menu.chip.64B.build.mcu=avr64db64
#avrdb64.menu.chip.64B.upload.maximum_size=65536
#avrdb64.menu.chip.64B.upload.maximum_data_size=8192


avrdb64.menu.clock.24internal=24 MHz internal
avrdb64.menu.clock.24internal.build.f_cpu=24000000L
avrdb64.menu.clock.24internal.build.speed=24
avrdb64.menu.clock.24internal.build.clocksource=0
avrdb64.menu.clock.20internal=20 MHz internal
avrdb64.menu.clock.20internal.build.f_cpu=20000000L
avrdb64.menu.clock.20internal.build.speed=20
avrdb64.menu.clock.20internal.build.clocksource=0
avrdb64.menu.clock.16internal=16 MHz internal
avrdb64.menu.clock.16internal.build.f_cpu=16000000L
avrdb64.menu.clock.16internal.build.speed=16
avrdb64.menu.clock.16internal.build.clocksource=0
avrdb64.menu.clock.12internal=12 MHz internal
avrdb64.menu.clock.12internal.build.f_cpu=12000000L
avrdb64.menu.clock.12internal.build.speed=12
avrdb64.menu.clock.12internal.build.clocksource=0
avrdb64.menu.clock.10internal=10 MHz internal
avrdb64.menu.clock.10internal.build.f_cpu=10000000L
avrdb64.menu.clock.10internal.build.speed=10
avrdb64.menu.clock.10internal.build.clocksource=0
avrdb64.menu.clock.8internal=8 MHz internal
avrdb64.menu.clock.8internal.build.f_cpu=8000000L
avrdb64.menu.clock.8internal.build.speed=8
avrdb64.menu.clock.8internal.build.clocksource=0
avrdb64.menu.clock.4internal=4 MHz internal
avrdb64.menu.clock.4internal.build.f_cpu=4000000L
avrdb64.menu.clock.4internal.build.speed=4
avrdb64.menu.clock.4internal.build.clocksource=0
avrdb64.menu.clock.1internal=1 MHz internal
avrdb64.menu.clock.1internal.build.f_cpu=1000000L
avrdb64.menu.clock.1internal.build.speed=1
avrdb64.menu.clock.1internal.build.clocksource=0
avrdb64.menu.clock.28internal=28 MHz internal (overclocked)
avrdb64.menu.clock.28internal.build.f_cpu=28000000L
avrdb64.menu.clock.28internal.build.speed=28
avrdb64.menu.clock.28internal.build.clocksource=0
avrdb64.menu.clock.32internal=32 MHz internal (overclocked)
avrdb64.menu.clock.32internal.build.f_cpu=32000000L
avrdb64.menu.clock.32internal.build.speed=32
avrdb64.menu.clock.32internal.build.clocksource=0
avrdb64.menu.clock.24crystal=24 MHz crystal
avrdb64.menu.clock.24crystal.build.f_cpu=24000000L
avrdb64.menu.clock.24crystal.build.speed=24
avrdb64.menu.clock.24crystal.build.clocksource=1
avrdb64.menu.clock.20crystal=20 MHz crystal
avrdb64.menu.clock.20crystal.build.f_cpu=20000000L
avrdb64.menu.clock.20crystal.build.speed=20
avrdb64.menu.clock.20crystal.build.clocksource=1
avrdb64.menu.clock.16crystal=16 MHz crystal
avrdb64.menu.clock.16crystal.build.f_cpu=16000000L
avrdb64.menu.clock.16crystal.build.speed=16
avrdb64.menu.clock.16crystal.build.clocksource=1
avrdb64.menu.clock.12crystal=12 MHz crystal
avrdb64.menu.clock.12crystal.build.f_cpu=12000000L
avrdb64.menu.clock.12crystal.build.speed=12
avrdb64.menu.clock.12crystal.build.clocksource=1
avrdb64.menu.clock.8crystal=8 MHz crystal
avrdb64.menu.clock.8crystal.build.f_cpu=8000000L
avrdb64.menu.clock.8crystal.build.speed=8
avrdb64.menu.clock.8crystal.build.clocksource=1
avrdb64.menu.clock.28crystal=28 MHz crystal (overclocked)
avrdb64.menu.clock.28crystal.build.f_cpu=28000000L
avrdb64.menu.clock.28crystal.build.speed=28
avrdb64.menu.clock.28crystal.build.clocksource=1
avrdb64.menu.clock.32crystal=32 MHz crystal (overclocked)
avrdb64.menu.clock.32crystal.build.f_cpu=32000000L
avrdb64.menu.clock.32crystal.build.speed=32
avrdb64.menu.clock.32crystal.build.clocksource=1
avrdb64.menu.clock.36crystal=36 MHz crystal (overclocked)
avrdb64.menu.clock.36crystal.build.f_cpu=36000000L
avrdb64.menu.clock.36crystal.build.speed=36
avrdb64.menu.clock.36crystal.build.clocksource=1
avrdb64.menu.clock.40crystal=40 MHz crystal (overclocked)
avrdb64.menu.clock.40crystal.build.f_cpu=40000000L
avrdb64.menu.clock.40crystal.build.speed=40
avrdb64.menu.clock.40crystal.build.clocksource=1
avrdb64.menu.clock.24extclock=24 MHz ext. clock
avrdb64.menu.clock.24extclock.build.f_cpu=24000000L
avrdb64.menu.clock.24extclock.build.speed=24
avrdb64.menu.clock.24extclock.build.clocksource=2
avrdb64.menu.clock.20extclock=20 MHz ext. clock
avrdb64.menu.clock.20extclock.build.f_cpu=20000000L
avrdb64.menu.clock.20extclock.build.speed=20
avrdb64.menu.clock.20extclock.build.clocksource=2
avrdb64.menu.clock.16extclock=16 MHz ext. clock
avrdb64.menu.clock.16extclock.build.f_cpu=16000000L
avrdb64.menu.clock.16extclock.build.speed=16
avrdb64.menu.clock.16extclock.build.clocksource=2
avrdb64.menu.clock.12extclock=12 MHz ext. clock
avrdb64.menu.clock.12extclock.build.f_cpu=12000000L
avrdb64.menu.clock.12extclock.build.speed=12
avrdb64.menu.clock.12extclock.build.clocksource=2
avrdb64.menu.clock.8extclock=8 MHz ext. clock
avrdb64.menu.clock.8extclock.build.f_cpu=8000000L
avrdb64.menu.clock.8extclock.build.speed=8
avrdb64.menu.clock.8extclock.build.clocksource=2
avrdb64.menu.clock.28extclock=28 MHz ext. clock (overclocked)
avrdb64.menu.clock.28extclock.build.f_cpu=28000000L
avrdb64.menu.clock.28extclock.build.speed=28
avrdb64.menu.clock.28extclock.build.clocksource=2
avrdb64.menu.clock.32extclock=32 MHz ext. clock (overclocked)
avrdb64.menu.clock.32extclock.build.f_cpu=32000000L
avrdb64.menu.clock.32extclock.build.speed=32
avrdb64.menu.clock.32extclock.build.clocksource=2
avrdb64.menu.clock.36extclock=36 MHz ext. clock (overclocked)
avrdb64.menu.clock.36extclock.build.f_cpu=36000000L
avrdb64.menu.clock.36extclock.build.speed=36
avrdb64.menu.clock.36extclock.build.clocksource=2
avrdb64.menu.clock.40extclock=40 MHz ext. clock (overclocked)
avrdb64.menu.clock.40extclock.build.f_cpu=40000000L
avrdb64.menu.clock.40extclock.build.speed=40
avrdb64.menu.clock.40extclock.build.clocksource=2
avrdb64.menu.clock.48extclock=48 MHz ext. clock (WAY overclocked)
avrdb64.menu.clock.48extclock.build.f_cpu=48000000L
avrdb64.menu.clock.48extclock.build.speed=48
avrdb64.menu.clock.48extclock.build.clocksource=2





avrdb64.menu.mvio.enabled=Enabled
avrdb64.menu.mvio.enabled.bootloader.SYSCFG1=0x0B
avrdb64.menu.mvio.disabled=Disabled
avrdb64.menu.mvio.disabled.bootloader.SYSCFG1=0x13


avrdb64.menu.bodvoltage.1v9=1.9V
avrdb64.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrdb64.menu.bodvoltage.2v45=2.45V
avrdb64.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrdb64.menu.bodvoltage.2v70=2.70V
avrdb64.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrdb64.menu.bodvoltage.2v85=2.85V
avrdb64.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrdb64.menu.bodmodeactive.disabled=Disabled
avrdb64.menu.bodmodeactive.enabled=Enabled
avrdb64.menu.bodmodeactive.sampled=Sampled
avrdb64.menu.bodmodeactive.enabledhold=Enabled hold wakeup
avrdb64.menu.bodmodesleep.disabled=Disabled
avrdb64.menu.bodmodesleep.enabled=Enabled
avrdb64.menu.bodmodesleep.sampled=Sampled
avrdb64.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
avrdb64.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
avrdb64.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
avrdb64.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
avrdb64.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
avrdb64.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
avrdb64.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10


avrdb64.menu.eesave.enable=EEPROM retained
avrdb64.menu.eesave.enable.bootloader.eesavebit=1
avrdb64.menu.eesave.disable=EEPROM not retained
avrdb64.menu.eesave.disable.bootloader.eesavebit=0

avrdb64.menu.resetpin.reset=Hardware Reset (recommended)
avrdb64.menu.resetpin.reset.bootloader.resetpinbits=10
avrdb64.menu.resetpin.input=Input (no output, ever)
avrdb64.menu.resetpin.input.bootloader.resetpinbits=00

avrdb64.menu.millis.tcb2=TCB2 (recommended)
avrdb64.menu.millis.tca0=TCA0
avrdb64.menu.millis.tca1=TCA1
avrdb64.menu.millis.tcb0=TCB0 (will break Servo)
avrdb64.menu.millis.tcb1=TCB1
avrdb64.menu.millis.tcb3=TCB3 (will break tone)
avrdb64.menu.millis.tcb4=TCB4
#avrdb64.menu.millis.tcd0=TCD0
avrdb64.menu.millis.disabled=Disabled

avrdb64.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
avrdb64.menu.millis.tcb0.build.millistimer=B0
avrdb64.menu.millis.tcb1.build.millistimer=B1
avrdb64.menu.millis.tcb2.build.millistimer=B2
avrdb64.menu.millis.tcb3.build.millistimer=B3
avrdb64.menu.millis.tcb4.build.millistimer=B4
avrdb64.menu.millis.tca0.build.millistimer=A0
avrdb64.menu.millis.tca1.build.millistimer=A1
#avrdb64.menu.millis.tcd0.build.millistimer=D0
avrdb64.menu.millis.disabled.build.millistimer=NONE

avrdb64.upload.tool=avrdude

avrdb64.build.board=avrdb64
avrdb64.build.core=dxcore
avrdb64.build.variant=64pin-standard
avrdb64.build.text_section_start=.text=0x0
avrdb64.build.extra_flags={build.millis} -DCLOCK_SOURCE={build.clocksource}

avrdb64.build.export_merged_output=false
avrdb64.build.mcupostfix=

avrdb64.bootloader.tool=avrdude
avrdb64.bootloader.WDTCFG=0x00
avrdb64.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits}
avrdb64.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
avrdb64.bootloader.CODESIZE=0x00
avrdb64.bootloader.BOOTSIZE=0x00

avrdb64.bootloader.flashcommand=


#########################################
#
#    28 PIN AVR DB-series
#
#########################################


avrdb28opti.name=28-pin AVR DB with Optiboot


avrdb28opti.menu.chip.128B=AVR128DB28
avrdb28opti.menu.chip.128B.build.mcu=avr128db28
avrdb28opti.menu.chip.128B.upload.maximum_size=130048
avrdb28opti.menu.chip.128B.upload.maximum_data_size=16384
avrdb28opti.menu.chip.128B.bootloader.file=hex/optiboot_dx128
#avrdb28opti.menu.chip.64B=AVR64DB28
#avrdb28opti.menu.chip.64B.build.mcu=avr64db28
#avrdb28opti.menu.chip.64B.upload.maximum_size=64512
#avrdb28opti.menu.chip.64B.upload.maximum_data_size=8192
#avrdb28opti.menu.chip.64B.bootloader.file=hex/optiboot_dx32
#avrdb28opti.menu.chip.32B=AVR32DB28
#avrdb28opti.menu.chip.32B.build.mcu=avr32db28
#avrdb28opti.menu.chip.32B.upload.maximum_size=32768
#avrdb28opti.menu.chip.32B.upload.maximum_data_size=4096
#avrdb28opti.menu.chip.64B.bootloader.file=hex/optiboot_dx64


