SpenceKonde/DxCore/megaavr/boards.txt
avrdb28opti.menu.clock.24internal=24 MHz internal
avrdb28opti.menu.clock.24internal.build.f_cpu=24000000L
avrdb28opti.menu.clock.24internal.build.speed=24
avrdb28opti.menu.clock.24internal.build.clocksource=0
avrdb28opti.menu.clock.20internal=20 MHz internal
avrdb28opti.menu.clock.20internal.build.f_cpu=20000000L
avrdb28opti.menu.clock.20internal.build.speed=20
avrdb28opti.menu.clock.20internal.build.clocksource=0
avrdb28opti.menu.clock.16internal=16 MHz internal
avrdb28opti.menu.clock.16internal.build.f_cpu=16000000L
avrdb28opti.menu.clock.16internal.build.speed=16
avrdb28opti.menu.clock.16internal.build.clocksource=0
avrdb28opti.menu.clock.12internal=12 MHz internal
avrdb28opti.menu.clock.12internal.build.f_cpu=12000000L
avrdb28opti.menu.clock.12internal.build.speed=12
avrdb28opti.menu.clock.12internal.build.clocksource=0
avrdb28opti.menu.clock.10internal=10 MHz internal
avrdb28opti.menu.clock.10internal.build.f_cpu=10000000L
avrdb28opti.menu.clock.10internal.build.speed=10
avrdb28opti.menu.clock.10internal.build.clocksource=0
avrdb28opti.menu.clock.8internal=8 MHz internal
avrdb28opti.menu.clock.8internal.build.f_cpu=8000000L
avrdb28opti.menu.clock.8internal.build.speed=8
avrdb28opti.menu.clock.8internal.build.clocksource=0
avrdb28opti.menu.clock.4internal=4 MHz internal
avrdb28opti.menu.clock.4internal.build.f_cpu=4000000L
avrdb28opti.menu.clock.4internal.build.speed=4
avrdb28opti.menu.clock.4internal.build.clocksource=0
avrdb28opti.menu.clock.1internal=1 MHz internal
avrdb28opti.menu.clock.1internal.build.f_cpu=1000000L
avrdb28opti.menu.clock.1internal.build.speed=1
avrdb28opti.menu.clock.1internal.build.clocksource=0
avrdb28opti.menu.clock.28internal=28 MHz internal (overclocked)
avrdb28opti.menu.clock.28internal.build.f_cpu=28000000L
avrdb28opti.menu.clock.28internal.build.speed=28
avrdb28opti.menu.clock.28internal.build.clocksource=0
avrdb28opti.menu.clock.32internal=32 MHz internal (overclocked)
avrdb28opti.menu.clock.32internal.build.f_cpu=32000000L
avrdb28opti.menu.clock.32internal.build.speed=32
avrdb28opti.menu.clock.32internal.build.clocksource=0
avrdb28opti.menu.clock.24crystal=24 MHz crystal
avrdb28opti.menu.clock.24crystal.build.f_cpu=24000000L
avrdb28opti.menu.clock.24crystal.build.speed=24
avrdb28opti.menu.clock.24crystal.build.clocksource=1
avrdb28opti.menu.clock.20crystal=20 MHz crystal
avrdb28opti.menu.clock.20crystal.build.f_cpu=20000000L
avrdb28opti.menu.clock.20crystal.build.speed=20
avrdb28opti.menu.clock.20crystal.build.clocksource=1
avrdb28opti.menu.clock.16crystal=16 MHz crystal
avrdb28opti.menu.clock.16crystal.build.f_cpu=16000000L
avrdb28opti.menu.clock.16crystal.build.speed=16
avrdb28opti.menu.clock.16crystal.build.clocksource=1
avrdb28opti.menu.clock.12crystal=12 MHz crystal
avrdb28opti.menu.clock.12crystal.build.f_cpu=12000000L
avrdb28opti.menu.clock.12crystal.build.speed=12
avrdb28opti.menu.clock.12crystal.build.clocksource=1
avrdb28opti.menu.clock.8crystal=8 MHz crystal
avrdb28opti.menu.clock.8crystal.build.f_cpu=8000000L
avrdb28opti.menu.clock.8crystal.build.speed=8
avrdb28opti.menu.clock.8crystal.build.clocksource=1
avrdb28opti.menu.clock.28crystal=28 MHz crystal (overclocked)
avrdb28opti.menu.clock.28crystal.build.f_cpu=28000000L
avrdb28opti.menu.clock.28crystal.build.speed=28
avrdb28opti.menu.clock.28crystal.build.clocksource=1
avrdb28opti.menu.clock.32crystal=32 MHz crystal (overclocked)
avrdb28opti.menu.clock.32crystal.build.f_cpu=32000000L
avrdb28opti.menu.clock.32crystal.build.speed=32
avrdb28opti.menu.clock.32crystal.build.clocksource=1
avrdb28opti.menu.clock.36crystal=36 MHz crystal (overclocked)
avrdb28opti.menu.clock.36crystal.build.f_cpu=36000000L
avrdb28opti.menu.clock.36crystal.build.speed=36
avrdb28opti.menu.clock.36crystal.build.clocksource=1
avrdb28opti.menu.clock.40crystal=40 MHz crystal (overclocked)
avrdb28opti.menu.clock.40crystal.build.f_cpu=40000000L
avrdb28opti.menu.clock.40crystal.build.speed=40
avrdb28opti.menu.clock.40crystal.build.clocksource=1
avrdb28opti.menu.clock.24extclock=24 MHz ext. clock
avrdb28opti.menu.clock.24extclock.build.f_cpu=24000000L
avrdb28opti.menu.clock.24extclock.build.speed=24
avrdb28opti.menu.clock.24extclock.build.clocksource=2
avrdb28opti.menu.clock.20extclock=20 MHz ext. clock
avrdb28opti.menu.clock.20extclock.build.f_cpu=20000000L
avrdb28opti.menu.clock.20extclock.build.speed=20
avrdb28opti.menu.clock.20extclock.build.clocksource=2
avrdb28opti.menu.clock.16extclock=16 MHz ext. clock
avrdb28opti.menu.clock.16extclock.build.f_cpu=16000000L
avrdb28opti.menu.clock.16extclock.build.speed=16
avrdb28opti.menu.clock.16extclock.build.clocksource=2
avrdb28opti.menu.clock.12extclock=12 MHz ext. clock
avrdb28opti.menu.clock.12extclock.build.f_cpu=12000000L
avrdb28opti.menu.clock.12extclock.build.speed=12
avrdb28opti.menu.clock.12extclock.build.clocksource=2
avrdb28opti.menu.clock.8extclock=8 MHz ext. clock
avrdb28opti.menu.clock.8extclock.build.f_cpu=8000000L
avrdb28opti.menu.clock.8extclock.build.speed=8
avrdb28opti.menu.clock.8extclock.build.clocksource=2
avrdb28opti.menu.clock.28extclock=28 MHz ext. clock (overclocked)
avrdb28opti.menu.clock.28extclock.build.f_cpu=28000000L
avrdb28opti.menu.clock.28extclock.build.speed=28
avrdb28opti.menu.clock.28extclock.build.clocksource=2
avrdb28opti.menu.clock.32extclock=32 MHz ext. clock (overclocked)
avrdb28opti.menu.clock.32extclock.build.f_cpu=32000000L
avrdb28opti.menu.clock.32extclock.build.speed=32
avrdb28opti.menu.clock.32extclock.build.clocksource=2
avrdb28opti.menu.clock.36extclock=36 MHz ext. clock (overclocked)
avrdb28opti.menu.clock.36extclock.build.f_cpu=36000000L
avrdb28opti.menu.clock.36extclock.build.speed=36
avrdb28opti.menu.clock.36extclock.build.clocksource=2
avrdb28opti.menu.clock.40extclock=40 MHz ext. clock (overclocked)
avrdb28opti.menu.clock.40extclock.build.f_cpu=40000000L
avrdb28opti.menu.clock.40extclock.build.speed=40
avrdb28opti.menu.clock.40extclock.build.clocksource=2
avrdb28opti.menu.clock.48extclock=48 MHz ext. clock (WAY overclocked)
avrdb28opti.menu.clock.48extclock.build.f_cpu=48000000L
avrdb28opti.menu.clock.48extclock.build.speed=48
avrdb28opti.menu.clock.48extclock.build.clocksource=2




avrdb28opti.menu.timeout.1sec=1 second (for use w/autoreset)
avrdb28opti.menu.timeout.1sec.bootloader.timeout=
avrdb28opti.menu.timeout.8sec=8 second (for use w/out autoreset)
avrdb28opti.menu.timeout.8sec.bootloader.timeout=_8sec


avrdb28opti.menu.mvio.enabled=Enabled
avrdb28opti.menu.mvio.enabled.bootloader.SYSCFG1=0x0B
avrdb28opti.menu.mvio.disabled=Disabled
avrdb28opti.menu.mvio.disabled.bootloader.SYSCFG1=0x13


avrdb28opti.menu.bodvoltage.1v9=1.9V
avrdb28opti.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrdb28opti.menu.bodvoltage.2v45=2.45V
avrdb28opti.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrdb28opti.menu.bodvoltage.2v70=2.70V
avrdb28opti.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrdb28opti.menu.bodvoltage.2v85=2.85V
avrdb28opti.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrdb28opti.menu.bodmodeactive.disabled=Disabled
avrdb28opti.menu.bodmodeactive.enabled=Enabled
avrdb28opti.menu.bodmodeactive.sampled=Sampled
avrdb28opti.menu.bodmodeactive.enabledhold=Enabled hold wakeup
avrdb28opti.menu.bodmodesleep.disabled=Disabled
avrdb28opti.menu.bodmodesleep.enabled=Enabled
avrdb28opti.menu.bodmodesleep.sampled=Sampled
avrdb28opti.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
avrdb28opti.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
avrdb28opti.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
avrdb28opti.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
avrdb28opti.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
avrdb28opti.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
avrdb28opti.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10


avrdb28opti.menu.millis.tcb2=TCB2 (recommended)
avrdb28opti.menu.millis.tca0=TCA0
avrdb28opti.menu.millis.tcb2=TCB0 (will break Servo)
avrdb28opti.menu.millis.tcb1=TCB1 (will break tone)
#avrdb28opti.menu.millis.tcd0=TCD0
avrdb28opti.menu.millis.disabled=Disabled

avrdb28opti.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
avrdb28opti.menu.millis.tcb0.build.millistimer=B0
avrdb28opti.menu.millis.tcb1.build.millistimer=B1
avrdb28opti.menu.millis.tcb2.build.millistimer=B2
avrdb28opti.menu.millis.tca0.build.millistimer=A0
#avrdb28opti.menu.millis.tcd0.build.millistimer=D0
avrdb28opti.menu.millis.disabled.build.millistimer=NONE

avrdb28opti.upload.tool=avrdude

