SpenceKonde/DxCore/megaavr/boards.txt
avrdb32opti.menu.millis.tcb2=TCB2 (recommended)
avrdb32opti.menu.millis.tca0=TCA0
avrdb32opti.menu.millis.tcb0=TCB0 (will break Servo)
avrdb32opti.menu.millis.tcb1=TCB1
#avrdb32opti.menu.millis.tcd0=TCD0
avrdb32opti.menu.millis.disabled=Disabled

avrdb32opti.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
avrdb32opti.menu.millis.tcb0.build.millistimer=B0
avrdb32opti.menu.millis.tcb1.build.millistimer=B1
avrdb32opti.menu.millis.tcb2.build.millistimer=B2
avrdb32opti.menu.millis.tca0.build.millistimer=A0
#avrdb32opti.menu.millis.tcd0.build.millistimer=D0
avrdb32opti.menu.millis.disabled.build.millistimer=NONE

avrdb32opti.upload.tool=avrdude

avrdb32opti.build.board=avrdb32
avrdb32opti.build.core=dxcore
avrdb32opti.build.variant=32pin-standard
avrdb32opti.build.extra_flags={build.millis} -DCLOCK_SOURCE={build.clocksource}


avrdb32opti.bootloader.tool=avrdude
avrdb32opti.bootloader.WDTCFG=0x00
avrdb32opti.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits}
avrdb32opti.bootloader.SYSCFG0=0xC8
avrdb32opti.bootloader.CODESIZE=0x00
avrdb32opti.bootloader.BOOTSIZE=0x02

avrdb32opti.upload.protocol=arduino
avrdb32opti.upload.extra_params=-D
avrdb32opti.upload.speed=115200
avrdb32opti.build.text_section_start=.text=0x400
avrdb32opti.build.mcupostfix=opti
avrdb32opti.bootloader.flashcommand=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}{bootloader.port}{bootloader.timeout}.hex:i
avrdb32opti.bootloader.tool=avrdude

avrdb32opti.menu.bootloaderusart.ser0=USART0, TX PA0 (0), RX PA1 (1)
avrdb32opti.menu.bootloaderusart.ser0.bootloader.port=_ser0
avrdb32opti.menu.bootloaderusart.ser0_alt=USART0, TX PA4 (4), RX PA5 (5)
avrdb32opti.menu.bootloaderusart.ser0_alt.bootloader.port=_ser0_alt
avrdb32opti.menu.bootloaderusart.ser1=USART1, TX PC0 (8), RX PC1 (9)
avrdb32opti.menu.bootloaderusart.ser1.bootloader.port=_ser1
avrdb32opti.menu.bootloaderusart.ser2=USART2, TX PF0 (20), RX PF1 (21)
avrdb32opti.menu.bootloaderusart.ser2.bootloader.port=_ser2
avrdb32opti.menu.bootloaderusart.ser2_alt=USART2, TX PF4 (24), RX PF5 (25)
avrdb32opti.menu.bootloaderusart.ser2_alt.bootloader.port=_ser2_alt

#########################################
#
#    48 PIN AVR DB-series
#
#########################################



avrdb48opti.name=48-pin AVR DB with Optiboot

avrdb48opti.menu.chip.128B=AVR128DB48
avrdb48opti.menu.chip.128B.build.mcu=avr128db48
avrdb48opti.menu.chip.128B.upload.maximum_size=130048
avrdb48opti.menu.chip.128B.upload.maximum_data_size=16384
avrdb48opti.menu.chip.128B.bootloader.file=hex/optiboot_dx128
#avrdb48opti.menu.chip.64B=AVR64DB48
#avrdb48opti.menu.chip.64B.build.mcu=avr64db48
#avrdb48opti.menu.chip.64B.upload.maximum_size=64512
#avrdb48opti.menu.chip.64B.upload.maximum_data_size=8192
#avrdb48opti.menu.chip.64B.bootloader.file=hex/optiboot_dx64
#avrdb48opti.menu.chip.32B=AVR32DB48
#avrdb48opti.menu.chip.32B.build.mcu=avr32db48
#avrdb48opti.menu.chip.32B.upload.maximum_size=31744
#avrdb48opti.menu.chip.32B.upload.maximum_data_size=4096
#avrdb48opti.menu.chip.32B.bootloader.file=hex/optiboot_dx32
#avrdb48opti.menu.chip.64B=AVR64DB48
#avrdb48opti.menu.chip.64B.build.mcu=avr64db48
#avrdb48opti.menu.chip.64B.upload.maximum_size=64512
#avrdb48opti.menu.chip.64B.upload.maximum_data_size=8192
#avrdb48opti.menu.chip.64B.bootloader.file=hex/optiboot_dx64
#avrdb48opti.menu.chip.32B=AVR32DB48
#avrdb48opti.menu.chip.32B.build.mcu=avr32db48
#avrdb48opti.menu.chip.32B.upload.maximum_size=31744
#avrdb48opti.menu.chip.32B.upload.maximum_data_size=4096
#avrdb48opti.menu.chip.32B.bootloader.file=hex/optiboot_dx32


avrdb48opti.menu.clock.24internal=24 MHz internal
avrdb48opti.menu.clock.24internal.build.f_cpu=24000000L
avrdb48opti.menu.clock.24internal.build.speed=24
avrdb48opti.menu.clock.24internal.build.clocksource=0
avrdb48opti.menu.clock.20internal=20 MHz internal
avrdb48opti.menu.clock.20internal.build.f_cpu=20000000L
avrdb48opti.menu.clock.20internal.build.speed=20
avrdb48opti.menu.clock.20internal.build.clocksource=0
avrdb48opti.menu.clock.16internal=16 MHz internal
avrdb48opti.menu.clock.16internal.build.f_cpu=16000000L
avrdb48opti.menu.clock.16internal.build.speed=16
avrdb48opti.menu.clock.16internal.build.clocksource=0
avrdb48opti.menu.clock.12internal=12 MHz internal
avrdb48opti.menu.clock.12internal.build.f_cpu=12000000L
avrdb48opti.menu.clock.12internal.build.speed=12
avrdb48opti.menu.clock.12internal.build.clocksource=0
avrdb48opti.menu.clock.10internal=10 MHz internal
avrdb48opti.menu.clock.10internal.build.f_cpu=10000000L
avrdb48opti.menu.clock.10internal.build.speed=10
avrdb48opti.menu.clock.10internal.build.clocksource=0
avrdb48opti.menu.clock.8internal=8 MHz internal
avrdb48opti.menu.clock.8internal.build.f_cpu=8000000L
avrdb48opti.menu.clock.8internal.build.speed=8
avrdb48opti.menu.clock.8internal.build.clocksource=0
avrdb48opti.menu.clock.4internal=4 MHz internal
avrdb48opti.menu.clock.4internal.build.f_cpu=4000000L
avrdb48opti.menu.clock.4internal.build.speed=4
avrdb48opti.menu.clock.4internal.build.clocksource=0
avrdb48opti.menu.clock.1internal=1 MHz internal
avrdb48opti.menu.clock.1internal.build.f_cpu=1000000L
avrdb48opti.menu.clock.1internal.build.speed=1
avrdb48opti.menu.clock.1internal.build.clocksource=0
avrdb48opti.menu.clock.28internal=28 MHz internal (overclocked)
avrdb48opti.menu.clock.28internal.build.f_cpu=28000000L
avrdb48opti.menu.clock.28internal.build.speed=28
avrdb48opti.menu.clock.28internal.build.clocksource=0
avrdb48opti.menu.clock.32internal=32 MHz internal (overclocked)
avrdb48opti.menu.clock.32internal.build.f_cpu=32000000L
avrdb48opti.menu.clock.32internal.build.speed=32
avrdb48opti.menu.clock.32internal.build.clocksource=0
avrdb48opti.menu.clock.24crystal=24 MHz crystal
avrdb48opti.menu.clock.24crystal.build.f_cpu=24000000L
avrdb48opti.menu.clock.24crystal.build.speed=24
avrdb48opti.menu.clock.24crystal.build.clocksource=1
avrdb48opti.menu.clock.20crystal=20 MHz crystal
avrdb48opti.menu.clock.20crystal.build.f_cpu=20000000L
avrdb48opti.menu.clock.20crystal.build.speed=20
avrdb48opti.menu.clock.20crystal.build.clocksource=1
avrdb48opti.menu.clock.16crystal=16 MHz crystal
avrdb48opti.menu.clock.16crystal.build.f_cpu=16000000L
avrdb48opti.menu.clock.16crystal.build.speed=16
avrdb48opti.menu.clock.16crystal.build.clocksource=1
avrdb48opti.menu.clock.12crystal=12 MHz crystal
avrdb48opti.menu.clock.12crystal.build.f_cpu=12000000L
avrdb48opti.menu.clock.12crystal.build.speed=12
avrdb48opti.menu.clock.12crystal.build.clocksource=1
avrdb48opti.menu.clock.8crystal=8 MHz crystal
avrdb48opti.menu.clock.8crystal.build.f_cpu=8000000L
avrdb48opti.menu.clock.8crystal.build.speed=8
avrdb48opti.menu.clock.8crystal.build.clocksource=1
avrdb48opti.menu.clock.28crystal=28 MHz crystal (overclocked)
avrdb48opti.menu.clock.28crystal.build.f_cpu=28000000L
avrdb48opti.menu.clock.28crystal.build.speed=28
avrdb48opti.menu.clock.28crystal.build.clocksource=1
avrdb48opti.menu.clock.32crystal=32 MHz crystal (overclocked)
avrdb48opti.menu.clock.32crystal.build.f_cpu=32000000L
avrdb48opti.menu.clock.32crystal.build.speed=32
avrdb48opti.menu.clock.32crystal.build.clocksource=1
avrdb48opti.menu.clock.36crystal=36 MHz crystal (overclocked)
avrdb48opti.menu.clock.36crystal.build.f_cpu=36000000L
avrdb48opti.menu.clock.36crystal.build.speed=36
avrdb48opti.menu.clock.36crystal.build.clocksource=1
avrdb48opti.menu.clock.40crystal=40 MHz crystal (overclocked)
avrdb48opti.menu.clock.40crystal.build.f_cpu=40000000L
avrdb48opti.menu.clock.40crystal.build.speed=40
avrdb48opti.menu.clock.40crystal.build.clocksource=1
avrdb48opti.menu.clock.24extclock=24 MHz ext. clock
avrdb48opti.menu.clock.24extclock.build.f_cpu=24000000L
avrdb48opti.menu.clock.24extclock.build.speed=24
avrdb48opti.menu.clock.24extclock.build.clocksource=2
avrdb48opti.menu.clock.20extclock=20 MHz ext. clock
avrdb48opti.menu.clock.20extclock.build.f_cpu=20000000L
avrdb48opti.menu.clock.20extclock.build.speed=20
avrdb48opti.menu.clock.20extclock.build.clocksource=2
avrdb48opti.menu.clock.16extclock=16 MHz ext. clock
avrdb48opti.menu.clock.16extclock.build.f_cpu=16000000L
avrdb48opti.menu.clock.16extclock.build.speed=16
avrdb48opti.menu.clock.16extclock.build.clocksource=2
avrdb48opti.menu.clock.12extclock=12 MHz ext. clock
avrdb48opti.menu.clock.12extclock.build.f_cpu=12000000L
avrdb48opti.menu.clock.12extclock.build.speed=12
avrdb48opti.menu.clock.12extclock.build.clocksource=2
avrdb48opti.menu.clock.8extclock=8 MHz ext. clock
avrdb48opti.menu.clock.8extclock.build.f_cpu=8000000L
avrdb48opti.menu.clock.8extclock.build.speed=8
avrdb48opti.menu.clock.8extclock.build.clocksource=2
avrdb48opti.menu.clock.28extclock=28 MHz ext. clock (overclocked)
avrdb48opti.menu.clock.28extclock.build.f_cpu=28000000L
avrdb48opti.menu.clock.28extclock.build.speed=28
avrdb48opti.menu.clock.28extclock.build.clocksource=2
avrdb48opti.menu.clock.32extclock=32 MHz ext. clock (overclocked)
avrdb48opti.menu.clock.32extclock.build.f_cpu=32000000L
avrdb48opti.menu.clock.32extclock.build.speed=32
avrdb48opti.menu.clock.32extclock.build.clocksource=2
avrdb48opti.menu.clock.36extclock=36 MHz ext. clock (overclocked)
avrdb48opti.menu.clock.36extclock.build.f_cpu=36000000L
avrdb48opti.menu.clock.36extclock.build.speed=36
avrdb48opti.menu.clock.36extclock.build.clocksource=2
avrdb48opti.menu.clock.40extclock=40 MHz ext. clock (overclocked)
avrdb48opti.menu.clock.40extclock.build.f_cpu=40000000L
avrdb48opti.menu.clock.40extclock.build.speed=40
avrdb48opti.menu.clock.40extclock.build.clocksource=2
avrdb48opti.menu.clock.48extclock=48 MHz ext. clock (WAY overclocked)
avrdb48opti.menu.clock.48extclock.build.f_cpu=48000000L
avrdb48opti.menu.clock.48extclock.build.speed=48
avrdb48opti.menu.clock.48extclock.build.clocksource=2





avrdb48opti.menu.timeout.1sec=1 second (for use w/autoreset)
avrdb48opti.menu.timeout.1sec.bootloader.timeout=
avrdb48opti.menu.timeout.8sec=8 second (for use w/out autoreset)
avrdb48opti.menu.timeout.8sec.bootloader.timeout=_8sec

