SpenceKonde/DxCore/megaavr/boards.txt
avrdb48opti.menu.mvio.enabled=Enabled
avrdb48opti.menu.mvio.enabled.bootloader.SYSCFG1=0x0B
avrdb48opti.menu.mvio.disabled=Disabled
avrdb48opti.menu.mvio.disabled.bootloader.SYSCFG1=0x13


avrdb48opti.menu.bodvoltage.1v9=1.9V
avrdb48opti.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrdb48opti.menu.bodvoltage.2v45=2.45V
avrdb48opti.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrdb48opti.menu.bodvoltage.2v70=2.70V
avrdb48opti.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrdb48opti.menu.bodvoltage.2v85=2.85V
avrdb48opti.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrdb48opti.menu.bodmodeactive.disabled=Disabled
avrdb48opti.menu.bodmodeactive.enabled=Enabled
avrdb48opti.menu.bodmodeactive.sampled=Sampled
avrdb48opti.menu.bodmodeactive.enabledhold=Enabled hold wakeup
avrdb48opti.menu.bodmodesleep.disabled=Disabled
avrdb48opti.menu.bodmodesleep.enabled=Enabled
avrdb48opti.menu.bodmodesleep.sampled=Sampled
avrdb48opti.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
avrdb48opti.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
avrdb48opti.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
avrdb48opti.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
avrdb48opti.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
avrdb48opti.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
avrdb48opti.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10

avrdb48opti.menu.millis.tcb2=TCB2 (recommended)
avrdb48opti.menu.millis.tca0=TCA0
avrdb48opti.menu.millis.tca1=TCA1
avrdb48opti.menu.millis.tcb0=TCB0 (will break Servo)
avrdb48opti.menu.millis.tcb1=TCB1
avrdb48opti.menu.millis.tcb3=TCB3 (will break tone)
#avrdb48opti.menu.millis.tcd0=TCD0
avrdb48opti.menu.millis.disabled=Disabled

avrdb48opti.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
avrdb48opti.menu.millis.tcb0.build.millistimer=B0
avrdb48opti.menu.millis.tcb1.build.millistimer=B1
avrdb48opti.menu.millis.tcb2.build.millistimer=B2
avrdb48opti.menu.millis.tcb3.build.millistimer=B2
avrdb48opti.menu.millis.tca0.build.millistimer=A0
avrdb48opti.menu.millis.tca1.build.millistimer=A1
#avrdb48opti.menu.millis.tcd0.build.millistimer=D0
avrdb48opti.menu.millis.disabled.build.millistimer=NONE

avrdb48opti.upload.tool=avrdude

avrdb48opti.build.board=avrdb48
avrdb48opti.build.core=dxcore
avrdb48opti.build.variant=48pin-standard
avrdb48opti.build.extra_flags={build.millis} -DCLOCK_SOURCE={build.clocksource}

avrdb48opti.build.export_merged_output=true

avrdb48opti.bootloader.tool=avrdude
avrdb48opti.bootloader.WDTCFG=0x00
avrdb48opti.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits}
avrdb48opti.bootloader.SYSCFG0=0xC8
avrdb48opti.bootloader.CODESIZE=0x00
avrdb48opti.bootloader.BOOTSIZE=0x02

avrdb48opti.upload.protocol=arduino
avrdb48opti.upload.extra_params=-D
avrdb48opti.upload.speed=115200
avrdb48opti.build.text_section_start=.text=0x400
avrdb48opti.build.mcupostfix=opti
avrdb48opti.bootloader.flashcommand=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}{bootloader.port}{bootloader.timeout}.hex:i
avrdb48opti.bootloader.tool=avrdude

avrdb48opti.menu.bootloaderusart.ser0=USART0, TX PA0 (0), RX PA1 (1)
avrdb48opti.menu.bootloaderusart.ser0.bootloader.port=_ser0
avrdb48opti.menu.bootloaderusart.ser0_alt=USART0, TX PA4 (4), RX PA5 (5)
avrdb48opti.menu.bootloaderusart.ser0_alt.bootloader.port=_ser0_alt
avrdb48opti.menu.bootloaderusart.ser1=USART1, TX PC0 (14), RX PC1 (15)
avrdb48opti.menu.bootloaderusart.ser1.bootloader.port=_ser1
avrdb48opti.menu.bootloaderusart.ser1_alt=USART1, TX PC4 (18), RX PC5 (19)
avrdb48opti.menu.bootloaderusart.ser1_alt.bootloader.port=_ser1_alt
avrdb48opti.menu.bootloaderusart.ser2=USART2, TX PF0 (34), RX PF1 (35)
avrdb48opti.menu.bootloaderusart.ser2.bootloader.port=_ser2
avrdb48opti.menu.bootloaderusart.ser2_alt=USART2, TX PF4 (38), RX PF5 (39)
avrdb48opti.menu.bootloaderusart.ser2_alt.bootloader.port=_ser2_alt
avrdb48opti.menu.bootloaderusart.ser3=USART3, TX PB0 (8), RX PB1 (9)
avrdb48opti.menu.bootloaderusart.ser3.bootloader.port=_ser3
avrdb48opti.menu.bootloaderusart.ser3_alt=USART3, TX PB4 (12), RX PB5 (13)
avrdb48opti.menu.bootloaderusart.ser3_alt.bootloader.port=_ser3_alt
avrdb48opti.menu.bootloaderusart.ser4=USART4, TX PE0 (30), RX PE1 (31)
avrdb48opti.menu.bootloaderusart.ser4.bootloader.port=_ser4



#########################################
#
#    64 PIN AVR DB-series
#
#########################################


avrdb64opti.name=64-pin AVR DB with Optiboot



avrdb64opti.menu.chip.128B=AVR128DB64
avrdb64opti.menu.chip.128B.build.mcu=avr128db64
avrdb64opti.menu.chip.128B.upload.maximum_size=130048
avrdb64opti.menu.chip.128B.upload.maximum_data_size=16384
avrdb64opti.menu.chip.128B.bootloader.file=hex/optiboot_dx128
#avrdb64opti.menu.chip.64B=AVR64DB64
#avrdb64opti.menu.chip.64B.build.mcu=avr64db64
#avrdb64opti.menu.chip.64B.upload.maximum_size=64512
#avrdb64opti.menu.chip.64B.upload.maximum_data_size=8192
#avrdb64opti.menu.chip.64B.bootloader.file=hex/optiboot_dx64


avrdb64opti.menu.clock.24internal=24 MHz internal
avrdb64opti.menu.clock.24internal.build.f_cpu=24000000L
avrdb64opti.menu.clock.24internal.build.speed=24
avrdb64opti.menu.clock.24internal.build.clocksource=0
avrdb64opti.menu.clock.20internal=20 MHz internal
avrdb64opti.menu.clock.20internal.build.f_cpu=20000000L
avrdb64opti.menu.clock.20internal.build.speed=20
avrdb64opti.menu.clock.20internal.build.clocksource=0
avrdb64opti.menu.clock.16internal=16 MHz internal
avrdb64opti.menu.clock.16internal.build.f_cpu=16000000L
avrdb64opti.menu.clock.16internal.build.speed=16
avrdb64opti.menu.clock.16internal.build.clocksource=0
avrdb64opti.menu.clock.12internal=12 MHz internal
avrdb64opti.menu.clock.12internal.build.f_cpu=12000000L
avrdb64opti.menu.clock.12internal.build.speed=12
avrdb64opti.menu.clock.12internal.build.clocksource=0
avrdb64opti.menu.clock.10internal=10 MHz internal
avrdb64opti.menu.clock.10internal.build.f_cpu=10000000L
avrdb64opti.menu.clock.10internal.build.speed=10
avrdb64opti.menu.clock.10internal.build.clocksource=0
avrdb64opti.menu.clock.8internal=8 MHz internal
avrdb64opti.menu.clock.8internal.build.f_cpu=8000000L
avrdb64opti.menu.clock.8internal.build.speed=8
avrdb64opti.menu.clock.8internal.build.clocksource=0
avrdb64opti.menu.clock.4internal=4 MHz internal
avrdb64opti.menu.clock.4internal.build.f_cpu=4000000L
avrdb64opti.menu.clock.4internal.build.speed=4
avrdb64opti.menu.clock.4internal.build.clocksource=0
avrdb64opti.menu.clock.1internal=1 MHz internal
avrdb64opti.menu.clock.1internal.build.f_cpu=1000000L
avrdb64opti.menu.clock.1internal.build.speed=1
avrdb64opti.menu.clock.1internal.build.clocksource=0
avrdb64opti.menu.clock.28internal=28 MHz internal (overclocked)
avrdb64opti.menu.clock.28internal.build.f_cpu=28000000L
avrdb64opti.menu.clock.28internal.build.speed=28
avrdb64opti.menu.clock.28internal.build.clocksource=0
avrdb64opti.menu.clock.32internal=32 MHz internal (overclocked)
avrdb64opti.menu.clock.32internal.build.f_cpu=32000000L
avrdb64opti.menu.clock.32internal.build.speed=32
avrdb64opti.menu.clock.32internal.build.clocksource=0
avrdb64opti.menu.clock.24crystal=24 MHz crystal
avrdb64opti.menu.clock.24crystal.build.f_cpu=24000000L
avrdb64opti.menu.clock.24crystal.build.speed=24
avrdb64opti.menu.clock.24crystal.build.clocksource=1
avrdb64opti.menu.clock.20crystal=20 MHz crystal
avrdb64opti.menu.clock.20crystal.build.f_cpu=20000000L
avrdb64opti.menu.clock.20crystal.build.speed=20
avrdb64opti.menu.clock.20crystal.build.clocksource=1
avrdb64opti.menu.clock.16crystal=16 MHz crystal
avrdb64opti.menu.clock.16crystal.build.f_cpu=16000000L
avrdb64opti.menu.clock.16crystal.build.speed=16
avrdb64opti.menu.clock.16crystal.build.clocksource=1
avrdb64opti.menu.clock.12crystal=12 MHz crystal
avrdb64opti.menu.clock.12crystal.build.f_cpu=12000000L
avrdb64opti.menu.clock.12crystal.build.speed=12
avrdb64opti.menu.clock.12crystal.build.clocksource=1
avrdb64opti.menu.clock.8crystal=8 MHz crystal
avrdb64opti.menu.clock.8crystal.build.f_cpu=8000000L
avrdb64opti.menu.clock.8crystal.build.speed=8
avrdb64opti.menu.clock.8crystal.build.clocksource=1
avrdb64opti.menu.clock.28crystal=28 MHz crystal (overclocked)
avrdb64opti.menu.clock.28crystal.build.f_cpu=28000000L
avrdb64opti.menu.clock.28crystal.build.speed=28
avrdb64opti.menu.clock.28crystal.build.clocksource=1
avrdb64opti.menu.clock.32crystal=32 MHz crystal (overclocked)
avrdb64opti.menu.clock.32crystal.build.f_cpu=32000000L
avrdb64opti.menu.clock.32crystal.build.speed=32
avrdb64opti.menu.clock.32crystal.build.clocksource=1
avrdb64opti.menu.clock.36crystal=36 MHz crystal (overclocked)
avrdb64opti.menu.clock.36crystal.build.f_cpu=36000000L
avrdb64opti.menu.clock.36crystal.build.speed=36
avrdb64opti.menu.clock.36crystal.build.clocksource=1
avrdb64opti.menu.clock.40crystal=40 MHz crystal (overclocked)
avrdb64opti.menu.clock.40crystal.build.f_cpu=40000000L
avrdb64opti.menu.clock.40crystal.build.speed=40
avrdb64opti.menu.clock.40crystal.build.clocksource=1
avrdb64opti.menu.clock.24extclock=24 MHz ext. clock
avrdb64opti.menu.clock.24extclock.build.f_cpu=24000000L
avrdb64opti.menu.clock.24extclock.build.speed=24
avrdb64opti.menu.clock.24extclock.build.clocksource=2
avrdb64opti.menu.clock.20extclock=20 MHz ext. clock
avrdb64opti.menu.clock.20extclock.build.f_cpu=20000000L
avrdb64opti.menu.clock.20extclock.build.speed=20
avrdb64opti.menu.clock.20extclock.build.clocksource=2
avrdb64opti.menu.clock.16extclock=16 MHz ext. clock
avrdb64opti.menu.clock.16extclock.build.f_cpu=16000000L
avrdb64opti.menu.clock.16extclock.build.speed=16
avrdb64opti.menu.clock.16extclock.build.clocksource=2
avrdb64opti.menu.clock.12extclock=12 MHz ext. clock
avrdb64opti.menu.clock.12extclock.build.f_cpu=12000000L
avrdb64opti.menu.clock.12extclock.build.speed=12
avrdb64opti.menu.clock.12extclock.build.clocksource=2
avrdb64opti.menu.clock.8extclock=8 MHz ext. clock
avrdb64opti.menu.clock.8extclock.build.f_cpu=8000000L
avrdb64opti.menu.clock.8extclock.build.speed=8
avrdb64opti.menu.clock.8extclock.build.clocksource=2
avrdb64opti.menu.clock.28extclock=28 MHz ext. clock (overclocked)
avrdb64opti.menu.clock.28extclock.build.f_cpu=28000000L
avrdb64opti.menu.clock.28extclock.build.speed=28
avrdb64opti.menu.clock.28extclock.build.clocksource=2
avrdb64opti.menu.clock.32extclock=32 MHz ext. clock (overclocked)
avrdb64opti.menu.clock.32extclock.build.f_cpu=32000000L
avrdb64opti.menu.clock.32extclock.build.speed=32
avrdb64opti.menu.clock.32extclock.build.clocksource=2
avrdb64opti.menu.clock.36extclock=36 MHz ext. clock (overclocked)
avrdb64opti.menu.clock.36extclock.build.f_cpu=36000000L
avrdb64opti.menu.clock.36extclock.build.speed=36
avrdb64opti.menu.clock.36extclock.build.clocksource=2
avrdb64opti.menu.clock.40extclock=40 MHz ext. clock (overclocked)
avrdb64opti.menu.clock.40extclock.build.f_cpu=40000000L
avrdb64opti.menu.clock.40extclock.build.speed=40
avrdb64opti.menu.clock.40extclock.build.clocksource=2
avrdb64opti.menu.clock.48extclock=48 MHz ext. clock (WAY overclocked)
avrdb64opti.menu.clock.48extclock.build.f_cpu=48000000L
avrdb64opti.menu.clock.48extclock.build.speed=48
avrdb64opti.menu.clock.48extclock.build.clocksource=2





avrdb64opti.menu.timeout.1sec=1 second (for use w/autoreset)
avrdb64opti.menu.timeout.1sec.bootloader.timeout=
avrdb64opti.menu.timeout.8sec=8 second (for use w/out autoreset)
avrdb64opti.menu.timeout.8sec.bootloader.timeout=_8sec

avrdb64opti.menu.mvio.enabled=Enabled
avrdb64opti.menu.mvio.enabled.bootloader.SYSCFG1=0x0B
avrdb64opti.menu.mvio.disabled=Disabled
avrdb64opti.menu.mvio.disabled.bootloader.SYSCFG1=0x13


avrdb64opti.menu.bodvoltage.1v9=1.9V
avrdb64opti.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrdb64opti.menu.bodvoltage.2v45=2.45V
avrdb64opti.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrdb64opti.menu.bodvoltage.2v70=2.70V
avrdb64opti.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrdb64opti.menu.bodvoltage.2v85=2.85V
avrdb64opti.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrdb64opti.menu.bodmodeactive.disabled=Disabled
avrdb64opti.menu.bodmodeactive.enabled=Enabled
avrdb64opti.menu.bodmodeactive.sampled=Sampled
avrdb64opti.menu.bodmodeactive.enabledhold=Enabled hold wakeup
avrdb64opti.menu.bodmodesleep.disabled=Disabled
avrdb64opti.menu.bodmodesleep.enabled=Enabled
avrdb64opti.menu.bodmodesleep.sampled=Sampled
avrdb64opti.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
avrdb64opti.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
avrdb64opti.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
avrdb64opti.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
avrdb64opti.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
avrdb64opti.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
avrdb64opti.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10



