SpenceKonde/DxCore/megaavr/boards.txt
avrdb64opti.menu.millis.tcb2=TCB2 (recommended)
avrdb64opti.menu.millis.tca0=TCA0
avrdb64opti.menu.millis.tca1=TCA1
avrdb64opti.menu.millis.tcb0=TCB0 (will break Servo)
avrdb64opti.menu.millis.tcb1=TCB1
avrdb64opti.menu.millis.tcb3=TCB3 (will break tone)
avrdb64opti.menu.millis.tcb4=TCB4
#avrdb64opti.menu.millis.tcd0=TCD0
avrdb64opti.menu.millis.disabled=Disabled

avrdb64opti.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
avrdb64opti.menu.millis.tcb0.build.millistimer=B0
avrdb64opti.menu.millis.tcb1.build.millistimer=B1
avrdb64opti.menu.millis.tcb2.build.millistimer=B2
avrdb64opti.menu.millis.tcb3.build.millistimer=B3
avrdb64opti.menu.millis.tcb4.build.millistimer=B4
avrdb64opti.menu.millis.tca0.build.millistimer=A0
avrdb64opti.menu.millis.tca1.build.millistimer=A1
#avrdb64opti.menu.millis.tcd0.build.millistimer=D0
avrdb64opti.menu.millis.disabled.build.millistimer=NONE

avrdb64opti.upload.tool=avrdude

avrdb64opti.build.board=avrdb64
avrdb64opti.build.core=dxcore
avrdb64opti.build.variant=64pin-standard
avrdb64opti.build.extra_flags={build.millis} -DCLOCK_SOURCE={build.clocksource}

avrdb64opti.build.export_merged_output=true

avrdb64opti.bootloader.tool=avrdude
avrdb64opti.bootloader.WDTCFG=0x00
avrdb64opti.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits}
avrdb64opti.bootloader.SYSCFG0=0xC8
avrdb64opti.bootloader.CODESIZE=0x00
avrdb64opti.bootloader.BOOTSIZE=0x02

avrdb64opti.upload.protocol=arduino
avrdb64opti.upload.extra_params=-D
avrdb64opti.upload.speed=115200
avrdb64opti.build.text_section_start=.text=0x400
avrdb64opti.build.mcupostfix=opti
avrdb64opti.bootloader.flashcommand=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}{bootloader.port}{bootloader.timeout}.hex:i
avrdb64opti.bootloader.tool=avrdude

avrdb64opti.menu.bootloaderusart.ser0=USART0, TX PA0 (0), RX PA1 (1)
avrdb64opti.menu.bootloaderusart.ser0.bootloader.port=_ser0
avrdb64opti.menu.bootloaderusart.ser0_alt=USART0, TX PA4 (4), RX PA5 (5)
avrdb64opti.menu.bootloaderusart.ser0_alt.bootloader.port=_ser0_alt
avrdb64opti.menu.bootloaderusart.ser1=USART1, TX PC0 (16), RX PC1 (17)
avrdb64opti.menu.bootloaderusart.ser1.bootloader.port=_ser1
avrdb64opti.menu.bootloaderusart.ser1_alt=USART1, TX PC4 (20), RX PC5 (21)
avrdb64opti.menu.bootloaderusart.ser1_alt.bootloader.port=_ser1_alt
avrdb64opti.menu.bootloaderusart.ser2=USART2, TX PF0 (40), RX PF1 (41)
avrdb64opti.menu.bootloaderusart.ser2.bootloader.port=_ser2
avrdb64opti.menu.bootloaderusart.ser2_alt=USART2, TX PF4 (44), RX PF5 (45)
avrdb64opti.menu.bootloaderusart.ser2_alt.bootloader.port=_ser2_alt
avrdb64opti.menu.bootloaderusart.ser3=USART3, TX PB0 (8), RX PB1 (9)
avrdb64opti.menu.bootloaderusart.ser3.bootloader.port=_ser3
avrdb64opti.menu.bootloaderusart.ser3_alt=USART3, TX PB4 (12), RX PB5 (13)
avrdb64opti.menu.bootloaderusart.ser3_alt.bootloader.port=_ser3_alt
avrdb64opti.menu.bootloaderusart.ser4=USART4, TX PE0 (32), RX PE1 (33)
avrdb64opti.menu.bootloaderusart.ser4.bootloader.port=_ser4
avrdb64opti.menu.bootloaderusart.ser4_alt=USART4, TX PE4 (36), RX PE5 (37)
avrdb64opti.menu.bootloaderusart.ser4_alt.bootloader.port=_ser4_alt
avrdb64opti.menu.bootloaderusart.ser5=USART5, TX PG0 (46), RX PG1 (47)
avrdb64opti.menu.bootloaderusart.ser5.bootloader.port=_ser5
avrdb64opti.menu.bootloaderusart.ser5_alt=USART5, TX PG4 (50), RX PG5 (51)
avrdb64opti.menu.bootloaderusart.ser5_alt.bootloader.port=_ser5_alt
